{
  "title": "Facebook Graph API node",
  "url": "https://docs.n8n.io/integrations/builtin/app-nodes/n8n-nodes-base.facebookgraphapi",
  "content": "---\ntitle: Facebook Graph API node documentation\ndescription: Learn how to use the Facebook Graph API node in n8n. Follow technical documentation to integrate Facebook Graph API node into your workflows.\ncontentType: [integration, reference]\npriority: medium\n---\n\n Facebook Graph API node\n\nUse the Facebook Graph API node to automate work in Facebook Graph API, and integrate Facebook Graph API with other applications. n8n has built-in support for a wide range of Facebook Graph API features, including using queries GET POST DELETE for several parameters like host URL, request methods and much more.\n\nOn this page, you'll find a list of operations the Facebook Graph API node supports and links to more resources.\n\n/// note | Credentials\nRefer to Facebook Graph API credentials for guidance on setting up authentication. \n///\n\n Operations\n\n Default\n     GET\n     POST\n     DELETE \n Video Uploads\n     GET\n     POST\n     DELETE \n\n Parameters\n\n--8<-- \"snippets/integrations/builtin/app-nodes/ai-tools.md\"\n\n Host URL: The host URL for the request. The following options are available:\n     Default: Requests are passed to the graph.facebook.com host URL. Used for the majority of requests.\n     Video: Requests are passed to the graph-video.facebook.com host URL. Used for video upload requests only.\n HTTP Request Method: The method to be used for this request, from the following options:\n     GET\n     POST\n     DELETE\n Graph API Version: The version of the Facebook Graph API to be used for this request.\n Node: The node on which to operate, for example /<page-id>/feed. Read more about it in the official Facebook Developer documentation.\n Edge: Edge of the node on which to operate. Edges represent collections of objects which are attached to the node.\n Ignore SSL Issues: Toggle to still download the response even if SSL certificate validation isn't possible.\n Send Binary File: Available for POST operations. If enabled binary data is sent as the body. Requires setting the following:\n     Input Binary Field: Name of the binary property which contains the data for the file to be uploaded.\n\n Templates and examples\n\n<!-- see https://www.notion.so/n8n/Pull-in-templates-for-the-integrations-pages-37c716837b804d30a33b47475f6e3780 -->\n[[ templatesWidget(page.title, 'facebook-graph-api') ]]",
  "category": "app-nodes",
  "nodeType": "n8n-nodes-base.facebookgraphapi.md",
  "keywords": [
    "facebook",
    "graph",
    "node",
    "post",
    "host",
    "request",
    "delete",
    "video",
    "requests",
    "used"
  ],
  "fetchedAt": "2025-10-07T16:14:26.439Z",
  "hash": "052f4616d7f55c1259b14010e0c9cc41"
}