{
  "title": "Weaviate Vector Store node",
  "url": "https://docs.n8n.io/integrations/builtin/cluster-nodes/root-nodes/n8n-nodes-langchain.vectorstoreweaviate",
  "content": "---\ntitle: Weaviate Vector Store node documentation\ndescription: Learn how to use the Weaviate Vector Store node in n8n. Follow technical documentation to integrate Weaviate Vector Store node into your workflows.\ncontentType: [integration, reference]\npriority: medium\n---\n\n Weaviate Vector Store node\n\nUse the Weaviate node to interact with your Weaviate collection as a vector store. You can insert documents into or retrieve documents from a vector database. You can also retrieve documents to provide them to a retriever connected to a chain or connect this node directly to an agent to use as a tool.\nOn this page, you'll find the node parameters for the Weaviate node, and links to more resources.\n\n/// note | Credentials\nYou can find authentication information for this node here.\n///\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/sub-node-expression-resolution.md\"\n\n Node usage patterns\n\nYou can use the Weaviate Vector Store node in the following patterns.\n\n Use as a regular node to insert and retrieve documents\n\nYou can use the Weaviate Vector Store as a regular node to insert or get documents. This pattern places the Weaviate Vector Store in the regular connection flow without using an agent.\n\n Connect directly to an AI agent as a tool\n\nYou can connect the Weaviate Vector Store node directly to the tool connector of an AI agent to use a vector store as a resource when answering queries.\n\nHere, the connection would be: AI agent (tools connector) -> Weaviate Vector Store node.\n\n Use a retriever to fetch documents\n\nYou can use the Vector Store Retriever node with the Weaviate Vector Store node to fetch documents from the Weaviate Vector Store node. This is often used with the Question and Answer Chain node to fetch documents from the vector store that match the given chat input.\n\n Use the Vector Store Question Answer Tool to answer questions\n\nAnother pattern uses the Vector Store Question Answer Tool to summarize results and answer questions from the Weaviate Vector Store node. Rather than connecting the Weaviate Vector Store directly as a tool, this pattern uses a tool specifically designed to summarizes data in the vector store.\n\n\t\n Node parameters\n\n/// note | Multitenancy\nYou can separate your data into isolated tenants for the same collection (for example, for different customers). For that, you must always provide a Tenant Name both when inserting and retrieving objects. Read more about multi tenancy in Weaviate docs.\n///\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/vector-store-mode.md\"\n\n<!-- vale from-write-good.Weasel = NO -->\n Get Many parameters\n<!-- vale from-write-good.Weasel = YES -->\n\n Weaviate Collection: Enter the name of the Weaviate collection to use.\n Prompt: Enter the search query.\n Limit: Enter how many results to retrieve from the vector store. For example, set this to 10 to get the ten best results.\n\n Insert Documents parameters\n\n Weaviate Collection: Enter the name of the Weaviate collection to use.\n Embedding Batch Size: The number of documents to embed in a single batch. The default is 200 documents.\n\n Retrieve Documents (As Vector Store for Chain/Tool) parameters\n\n Weaviate Collection: Enter the name of the Weaviate collection to use.\n\n Retrieve Documents (As Tool for AI Agent) parameters\n\n Weaviate Collection: The name of the vector store.\n Description: Explain to the LLM what this tool does. A good, specific description allows LLMs to produce expected results more often.\n Weaviate Collection: Enter the name of the Weaviate collection to use.\n Limit: Enter how many results to retrieve from the vector store. For example, set this to 10 to get the ten best results.\n\n Include Metadata\n\nWhether to include document metadata.\n\nYou can use this with the Get Many and Retrieve Documents (As Tool for AI Agent) modes.\n\n Rerank Results\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/vector-store-rerank-results.md\"\n\n Node options\n\n Search Filters\n\nAvailable for the Get Many, Retrieve Documents (As Vector Store for Chain/Tool), and Retrieve Documents (As Tool for AI Agent) operation modes.\n\nWhen searching for data, use this to match metadata associated with documents. You can learn more about the operators and query structure in Weaviate's conditional filters documentation.\n\nYou can use both AND and OR with different operators. Operators are case insensitive:\n\nSupported operators:\n\n| Operator           | Required Field(s)                                    | Description                                                                                                                                                                       |\n|--------------------|------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 'equal'          | valueString or valueNumber                       | Checks if the property is equal to the given string or number.                                                                                                                    |\n| 'like'           | valueString                                        | Checks if the string property matches a pattern (for example, sub-string match).                                                                                                  |\n| 'containsAny'    | valueTextArray (string\\[])                         | Checks if the property contains any of the given values.                                                                                                                      |\n| 'containsAll'    | valueTextArray (string\\[])                         | Checks if the property contains all of the given values.                                                                                                                      |\n| 'greaterThan'    | valueNumber                                        | Checks if the property value is greater than the given number.                                                                                                                    |\n| 'lessThan'       | valueNumber                                        | Checks if the property value is less than the given number.                                                                                                                       |\n| 'isNull'         | valueBoolean (true/false)                          | Checks if the property is null or not. (must enable before ingestion) |\n| 'withinGeoRange' | valueGeoCoordinates (object with geolocation data) | Filters by proximity to geographic coordinates.                                                                                                                                   |\n\nWhen inserting data, the document loader sets the metadata. Refer to Default Data Loader for more information on loading documents.\n\n Metadata Keys\n\nYou can define which metadata keys you want Weaviate to return on your queries. This can reduce network load, as you will only get properties you have defined. Returns all properties from the server by default.\n\nAvailable for the Get Many, Retrieve Documents (As Vector Store for Chain/Tool), and Retrieve Documents (As Tool for AI Agent) operation modes.\n\n Tenant Name\n\nThe specific tenant to store or retrieve documents for.\n\n/// note | Must enable at creation\nYou must pass a tenant name at first ingestion to enable multitenancy for a collection. You can't enable or disable multitenancy after creation.\n///\n\n Text Key\n\nThe key in the document that contains the embedded text.\n\n Skip Init Checks\n\nWhether to skip initialization checks when instantiating the client.\n\n Init Timeout\n\nNumber of seconds to wait before timing out during initial checks.\n\n Insert Timeout\n\nNumber of seconds to wait before timing out during inserts.\n\n Query Timeout\n\nNumber of seconds to wait before timing out during queries.\n\n GRPC Proxy\n\nA proxy ",
  "category": "cluster-nodes",
  "nodeType": "n8n-nodes-langchain.vectorstoreweaviate.md",
  "keywords": [
    "weaviate",
    "vector",
    "store",
    "node",
    "documents",
    "tool",
    "collection",
    "retrieve",
    "this",
    "checks"
  ],
  "fetchedAt": "2025-10-07T16:15:27.297Z",
  "hash": "058f4c9e31b54bff4cd4765a6838fda6"
}