{
  "title": "AI coding with GPT",
  "url": "https://docs.n8n.io/code/ai-code",
  "content": "---\ntitle: AI coding\ndescription: Use GPT to generate code in the Code node.\ncontentType: explanation\n---\n\n AI coding with GPT\n\nNot available on self-hosted.  \n\nPython isn't supported.\n///\n\n Use AI in the Code node\n\n--8<-- \"snippets/code/ai-how-to.md\"\n\n Usage limits\n\nDuring the trial phase there are no usage limits. If n8n makes the feature permanent, there may be usage limits as part of your pricing tier.\n\n Feature limits\n\nThe ChatGPT implementation in n8n has the following limitations:\n\n The AI writes code that manipulates data from the n8n workflow. You can't ask it to pull in data from other sources.\n The AI doesn't know your data, just the schema, so you need to tell it things like how to find the data you want to extract, or how to check for null.\n Nodes before the Code node must execute and deliver data to the Code node before you run your AI query.\n Doesn't work with large incoming data schemas.\n May have issues if there are a lot of nodes before the code node.\n\n Writing good prompts\n\n<!-- vale off -->\n\nWriting good prompts increases the chance of getting useful code back.\n\nSome general tips:\n\n Provide examples: if possible, give a sample expected output. This helps the AI to better understand the transformation or logic you’re aiming for.\n Describe the processing steps: if there are specific processing steps or logic that should apply to the data, list them in sequence. For example: \"First, filter out all users under 18. Then, sort the remaining users by their last name.\"\n Avoid ambiguities: while the AI understands various instructions, being clear and direct ensures you get the most accurate code. Instead of saying \"Get the older users,\" you might say \"Filter users who are 60 years and above.\"\n Be clear about what you expect as the output. Do you want the data transformed, filtered, aggregated, or sorted? Provide as much detail as possible.\n\nAnd some n8n-specific guidance:\n\n Think about the input data: make sure ChatGPT knows which pieces of the data you want to access, and what the incoming data represents. You may need to tell ChatGPT about the availability of n8n's built-in methods and variables.\n Declare interactions between nodes: if your logic involves data from multiple nodes, specify how they should interact. \"Merge the output of 'Node A' with 'Node B' based on the 'userID' property\". if you prefer data to come from certain nodes or to ignore others, be clear: \"Only consider data from the 'Purchases' node and ignore the 'Refunds' node.\"\n Ensure the output is compatible with n8n. Refer to Data structure for more information on the data structure n8n requires.\n\n Example prompts\n\nThese examples show a range of possible prompts and tasks.\n\n Example 1: Find a piece of data inside a second dataset\n\nTo try the example yourself, download the example workflow and import it into n8n.\n\nIn the third Code node, enter this prompt:\n\n> The slack data contains only one item. The input data represents all Notion users. Sometimes the person property that holds the email can be null. I want to find the notionId of the Slack user and return it.\n\nTake a look at the code the AI generates.\n\nThis is the JavaScript you need:\n\n Example 2: Data transformation\n\nTo try the example yourself, download the example workflow and import it into n8n.\n\nIn the Join items Code node, enter this prompt:\n\n> Return a single line of text that has all usernames listed with a comma. Each username should be enquoted with a double quotation mark.\n\nTake a look at the code the AI generates.\n\nThis is the JavaScript you need:\n\n Example 3: Summarize data and create a Slack message\n\nTo try the example yourself, download the example workflow and import it into n8n.\n\nIn the Summarize Code node, enter this prompt:\n\n> Create a markdown text for Slack that counts how many ideas, features and bugs have been submitted. The type of submission is saved in the propertytype field. A feature has the property \"Feature\", a bug has the property \"Bug\" and an idea has the property \"Bug\". Also, list the five top submissions by vote in that message. Use \"<url|text>\" as markdown for links.\n\nTake a look at the code the AI generates.\n\nThis is the JavaScript you need:\n\n<!-- vale on -->\n\n Reference incoming node data explicitly\n\nIf your incoming data contains nested fields, using dot notation to reference them can help the AI understand what data you want.\n\n!\"Screenshot of an n8n code node, highlighting how to reference data with dot notation in an AI query\"\n\nTo try the example yourself, download the example workflow and import it into n8n.\n\nIn the second Code node, enter this prompt:\n\n> The data in \"Mock data\" represents a list of people. For each person, return a new item containing personalinfo.firstname and workinfo.jobtitle.\n\nThis is the JavaScript you need:\n\n Related resources\n\nPluralsight offer a short guide on How to use ChatGPT to write code, which includes example prompts.\n\n Fixing the code\n\nThe AI-generated code may work without any changes, but you may have to edit it. You need to be aware of n8n's Data structure. You may also find n8n's built-in methods and variables useful.",
  "category": "code",
  "nodeType": null,
  "keywords": [
    "coding",
    "with",
    "data",
    "code",
    "node",
    "example",
    "this",
    "need",
    "that",
    "your",
    "from"
  ],
  "fetchedAt": "2025-10-07T16:15:44.611Z",
  "hash": "098f26d06810aeace7b39b7bd6604e9d"
}