{
  "title": "Deployment environment variables",
  "url": "https://docs.n8n.io/hosting/configuration/environment-variables/deployment",
  "content": "---\ntitle: Deployment environment variables\ndescription: Configure deployment options and application accessibility with environment variables for your self-hosted n8n instance. \ncontentType: reference\ntags:\n  - environment variables\nhide:\n  - toc\n  - tags\n---\n\n Deployment environment variables\n\n--8<-- \"snippets/self-hosting/file-based-configuration.md\"\n\nThis page lists the deployment configuration options for your self-hosted n8n instance, including setting up access URLs, enabling templates, customizing encryption, and configuring server details. \n\n<!-- vale Vale.Spelling = NO -->\n/// info | Proxy variable priorities\nThe proxy-from-env package that n8n uses to handle proxy environment variables (those ending with PROXY) imposes a certain variable precedence. Notably, for proxy variables, lowercase versions (like httpproxy) have precedence over uppercase variants (for example HTTPPROXY) when both are present.\n\nTo learn more about proxy environment variables, check the environment variables section of the package details.\n///\n<!-- vale Vale.Spelling = YES -->\n\n| Variable | Type  | Default  | Description |\n| :------- | :---- | :------- | :---------- |\n| HTTPPROXY | String | - | A URL to proxy unencrypted HTTP requests through. When set, n8n proxies all unencrypted HTTP traffic from nodes through the proxy URL. |\n| HTTPSPROXY | String | - | A URL to proxy TLS/SSL encrypted HTTP requests through. When set, n8n proxies all TLS/SSL encrypted HTTP traffic from nodes through the proxy URL. |\n| ALLPROXY | String | - | A URL to proxy both unencrypted and encrypted HTTP requests through. When set, n8n uses this value when more specific variables (HTTPPROXY or HTTPSPROXY) aren't present. |\n| NOPROXY | String | - | A comma-separated list of hostnames or URLs that should bypass the proxy. When using HTTPPROXY, HTTPSPROXY, or ALLPROXY, n8n will connect directly to the URLs or hostnames defined here instead of using the proxy. |\n| N8NEDITORBASEURL | String | - | Public URL where users can access the editor. Also used for emails sent from n8n and the redirect URL for SAML based authentication. |\n| N8NCONFIGFILES (deprecated) | String | - | Use to provide the path to a JSON configuration file. This option is deprecated and will be removed in a future version. Use .env files or FILE environment variables instead. |\n| N8NDISABLEUI | Boolean | false | Set to true to disable the UI. |\n| N8NPREVIEWMODE | Boolean | false | Set to true to run in preview mode. |\n| N8NTEMPLATESENABLED | Boolean | false | Enables workflow templates (true) or disable (false). |\n| N8NTEMPLATESHOST | String | https://api.n8n.io | Change this if creating your own workflow template library. Note that to use your own workflow templates library, your API must provide the same endpoints and response structure as n8n's. Refer to Workflow templates for more information. |\n| N8NENCRYPTIONKEY | String | Random key generated by n8n | Provide a custom key used to encrypt credentials in the n8n database. By default n8n generates a random key on first launch. |\n| N8NUSERFOLDER | String | user-folder | Provide the path where n8n will create the .n8n folder. This directory stores user-specific data, such as database file and encryption key. |\n| N8NPATH | String | / | The path n8n deploys to. |\n| N8NHOST | String | localhost | Host name n8n runs on. |\n| N8NPORT | Number | 5678 | The HTTP port n8n runs on. |\n| N8NLISTENADDRESS | String | :: | The IP address n8n should listen on. |\n| N8NPROTOCOL | Enum string: http, https | http | The protocol used to reach n8n. |\n| N8NSSLKEY | String | - | The SSL key for HTTPS protocol. |\n| N8NSSLCERT | String | - | The SSL certificate for HTTPS protocol. |\n| N8NPERSONALIZATIONENABLED | Boolean | true | Whether to ask users personalisation questions and then customise n8n accordingly. |\n| N8NVERSIONNOTIFICATIONSENABLED | Boolean | true | When enabled, n8n sends notifications of new versions and security updates. |\n| N8NVERSIONNOTIFICATIONSENDPOINT | String | https://api.n8n.io/versions/ | The endpoint to retrieve where version information. |\n| N8NVERSIONNOTIFICATIONSINFOURL | String | https://docs.n8n.io/getting-started/installation/updating.html | The URL displayed in the New Versions panel for more information. |\n| N8NDIAGNOSTICSENABLED | Boolean | true | Whether to share selected, anonymous telemetry with n8n. Note that if you set this to false, you can't enable Ask AI in the Code node. |\n| N8NDIAGNOSTICSCONFIGFRONTEND | String | 1zPn9bgWPzlQc0p8Gj1uiK6DOTn;https://telemetry.n8n.io | Telemetry configuration for the frontend. |\n| N8NDIAGNOSTICSCONFIGBACKEND | String | 1zPn7YoGC3ZXE9zLeTKLuQCB4F6;https://telemetry.n8n.io/v1/batch | Telemetry configuration for the backend. |\n| N8NPUSHBACKEND | String | websocket | Choose whether the n8n backend uses server-sent events (sse) or WebSockets (websocket) to send changes to the UI. |\n| VUEAPPURLBASEAPI | String | http://localhost:5678/ | Used when building the n8n-editor-ui package manually to set how the frontend can reach the backend API. Refer to Configure the Base URL. |\n| N8NHIRINGBANNERENABLED | Boolean | true | Whether to show the n8n hiring banner in the console (true) or not (false). |\n| N8NPUBLICAPISWAGGERUIDISABLED | Boolean | false | Whether the Swagger UI (API playground) is disabled (true) or not (false). |\n| N8NPUBLICAPIDISABLED | Boolean | false | Whether to disable the public API (true) or not (false). |\n| N8NPUBLICAPIENDPOINT | String | api | Path for the public API endpoints. |\n| N8NGRACEFULSHUTDOWNTIMEOUT | Number | 30 | How long should the n8n process wait (in seconds) for components to shut down before exiting the process. |\n| N8NDEVRELOAD | Boolean | false | When working on the n8n source code, set this to true to automatically reload or restart the application when changes occur in the source code files. |\n| N8NREINSTALLMISSINGPACKAGES | Boolean | false | If set to true, n8n will automatically attempt to reinstall any missing packages. |\n| N8NTUNNELSUBDOMAIN | String | - | Specifies the subdomain for the n8n tunnel. If not set, n8n generates a random subdomain.|\n| N8NPROXYHOPS | Number | 0 | Number of reverse-proxies n8n is running behind. |",
  "category": "hosting",
  "nodeType": null,
  "keywords": [
    "deployment",
    "environment",
    "variables",
    "string",
    "proxy",
    "false",
    "true",
    "boolean",
    "when",
    "http",
    "https"
  ],
  "fetchedAt": "2025-10-07T16:15:56.231Z",
  "hash": "22adbeabf3bace9ec6874cd066337ce4"
}