{
  "title": "Supabase Vector Store node",
  "url": "https://docs.n8n.io/integrations/builtin/cluster-nodes/root-nodes/n8n-nodes-langchain.vectorstoresupabase",
  "content": "---\ntitle: Supabase Vector Store node documentation\ndescription: Learn how to use the Supabase Vector Store node in n8n. Follow technical documentation to integrate Supabase Vector Store node into your workflows.\ncontentType: [integration, reference]\npriority: medium\n---\n\n Supabase Vector Store node\n\nUse the Supabase Vector Store to interact with your Supabase database as vector store. You can insert documents into a vector database, get many documents from a vector database, and retrieve documents to provide them to a retriever connected to a chain. \n\nUse the Supabase Vector Store to interact with your Supabase database as vector store. You can insert documents into a vector database, get documents from a vector database, retrieve documents to provide them to a retriever connected to a chain, or connect it directly to an agent to use as a tool. You can also update an item in a vector store by its ID.\n\nOn this page, you'll find the node parameters for the Supabase node, and links to more resources.\n\n/// note | Credentials\nYou can find authentication information for this node here.\n///\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/sub-node-expression-resolution.md\"\n\t\nSupabase provides a quickstart for setting up your vector store. If you use settings other than the defaults in the quickstart, this may affect parameter settings in n8n. Make sure you understand what you're doing.\n\n Node usage patterns\n\nYou can use the Supabase Vector Store node in the following patterns.\n\n Use as a regular node to insert, update, and retrieve documents\n\nYou can use the Supabase Vector Store as a regular node to insert, update, or get documents. This pattern places the Supabase Vector Store in the regular connection flow without using an agent.\n\nYou can see an example of this in scenario 1 of this template.\n\n Connect directly to an AI agent as a tool\n\nYou can connect the Supabase Vector Store node directly to the tool connector of an AI agent to use a vector store as a resource when answering queries.\n\nHere, the connection would be: AI agent (tools connector) -> Supabase Vector Store node.\n\n Use a retriever to fetch documents\n\nYou can use the Vector Store Retriever node with the Supabase Vector Store node to fetch documents from the Supabase Vector Store node. This is often used with the Question and Answer Chain node to fetch documents from the vector store that match the given chat input.\n\nAn example of the connection flow (the example uses Pinecone, but the pattern in the same) would be: Question and Answer Chain (Retriever connector) -> Vector Store Retriever (Vector Store connector) -> Supabase Vector Store.\n\n Use the Vector Store Question Answer Tool to answer questions\n\nAnother pattern uses the Vector Store Question Answer Tool to summarize results and answer questions from the Supabase Vector Store node. Rather than connecting the Supabase Vector Store directly as a tool, this pattern uses a tool specifically designed to summarizes data in the vector store.\n\nThe connections flow in this case would look like this: AI agent (tools connector) -> Vector Store Question Answer Tool (Vector Store connector) -> Supabase Vector store.\n\n Node parameters\n\n Operation Mode\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/vector-store-mode-with-update.md\"\n\n Rerank Results\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/vector-store-rerank-results.md\"\n\n<!-- vale from-write-good.Weasel = NO -->\n Get Many parameters\n<!-- vale from-write-good.Weasel = YES -->\n\n Table Name: Enter the Supabase table to use.\n Prompt: Enter the search query.\n Limit: Enter how many results to retrieve from the vector store. For example, set this to 10 to get the ten best results.\n\n Insert Documents parameters\n\n Table Name: Enter the Supabase table to use.\n\n Retrieve Documents (As Vector Store for Chain/Tool) parameters\n\n Table Name: Enter the Supabase table to use.\n\n Retrieve Documents (As Tool for AI Agent) parameters\n\n Name: The name of the vector store.\n Description: Explain to the LLM what this tool does. A good, specific description allows LLMs to produce expected results more often.\n Table Name: Enter the Supabase table to use.\n Limit: Enter how many results to retrieve from the vector store. For example, set this to 10 to get the ten best results.\n\n Update Documents\n\n Table Name: Enter the Supabase table to use.\n ID: The ID of an embedding entry.\n\nParameters for Update Documents\n\n ID\n\n Node options\n\n Query Name\n\nThe name of the matching function you set up in Supabase. If you follow the Supabase quickstart, this will be matchdocuments.\n\n Metadata Filter\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/langchain-root-nodes/vector-store-metadata-filter.md\"\n\n Templates and examples\n\n<!-- see https://www.notion.so/n8n/Pull-in-templates-for-the-integrations-pages-37c716837b804d30a33b47475f6e3780 -->\n[[ templatesWidget(page.title, 'supabase-vector-store') ]]\n\n Related resources\n\nRefer to LangChain's Supabase documentation for more information about the service.\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/langchain-overview-link.md\"",
  "category": "cluster-nodes",
  "nodeType": "n8n-nodes-langchain.vectorstoresupabase.md",
  "keywords": [
    "supabase",
    "vector",
    "store",
    "node",
    "documents",
    "this",
    "tool",
    "table",
    "from",
    "name"
  ],
  "fetchedAt": "2025-10-07T16:15:27.146Z",
  "hash": "263f5a441a92970237978a35a2dcbc69"
}