{
  "title": "Telegram node Message operations",
  "url": "https://docs.n8n.io/integrations/builtin/app-nodes/n8n-nodes-base.telegram/message-operations",
  "content": "---\ntitle: Telegram node Message operations documentation\ndescription: Documentation for the Message operations in the Telegram node in n8n, a workflow automation platform. Includes details to configure all Message operations.\ncontentType: [integration, reference]\npriority: critical\n---\n\n Telegram node Message operations\n\nUse these operations to send, edit, and delete messages in a chat; send files to a chat; and pin/unpin message from a chat. Refer to Telegram for more information on the Telegram node itself.\n\n/// note | Add bot to channel\nTo use most of these operations, you must add your bot to a channel so that it can send messages to that channel. Refer to Common Issues | Add a bot to a Telegram channel for more information.\n///\n\n--8<-- \"snippets/integrations/builtin/app-nodes/ai-tools.md\"\ns\n Delete Chat Message\n\nUse this operation to delete a message from chat using the Bot API deleteMessage method.\n\nEnter these parameters:\n\n Credential to connect with: Create or select an existing Telegram credential.\n Resource: Select Message.\n Operation: Select Delete Chat Message.\n Chat ID: Enter the Chat ID or username of the channel you wish to delete in the format @channelusername.\n     To feed a Chat ID directly into this node, use the Telegram Trigger node. Refer to Common Issues | Get the Chat ID for more information.\n Message ID: Enter the unique identifier of the message you want to delete.\n\nRefer to the Telegram Bot API deleteMessage documentation for more information.\n\n Edit Message Text\n\nUse this operation to edit the text of an existing message using the Bot API editMessageText method.\n\nEnter these parameters:\n\n Credential to connect with: Create or select an existing Telegram credential.\n Resource: Select Message.\n Operation: Select Edit Message Text.\n Chat ID: Enter the Chat ID or username of the channel you wish to leave in the format @channelusername.\n     To feed a Chat ID directly into this node, use the Telegram Trigger node. Refer to Common Issues | Get the Chat ID for more information.\n Message ID: Enter the unique identifier of the message you want to edit.\n Reply Markup: Select whether to use the Inline Keyboard to display the InlineKeyboardMarkup None not to. This sets the replymarkup parameter. Refer to the InlineKeyboardMarkup documentation for more information.\n Text: Enter the text you want to edit the message to.\n\nRefer to the Telegram Bot API editMessageText documentation for more information.\n\n<!-- vale off -->\n Edit Message Text additional fields\n\nUse the Additional Fields to further refine the behavior of the node. Select Add Field to add any of the following:\n\n Disable WebPage Preview: Select whether you want to enable link previews for links in this message (turned off) or disable link previews for links in this message (turned on). This sets the linkpreviewoptions parameter for isdisabled. Refer to the LinkPreviewOptions documentation for more information.\n Parse Mode: Choose whether the message should be parsed using HTML (default), Markdown (Legacy), or MarkdownV2. This sets the parsemode parameter.\n<!-- vale on -->\n\n Pin Chat Message\n\nUse this operation to pin a message for the chat using the Bot API pinChatMessage method.\n\nEnter these parameters:\n\n Credential to connect with: Create or select an existing Telegram credential.\n Resource: Select Message.\n Operation: Select Pin Chat Message.\n Chat ID: Enter the Chat ID or username of the channel you wish to pin the message to in the format @channelusername.\n     To feed a Chat ID directly into this node, use the Telegram Trigger node. Refer to Common Issues | Get the Chat ID for more information.\n Message ID: Enter the unique identifier of the message you want to pin.\n\nRefer to the Telegram Bot API pinChatMessage documentation for more information.\n\n<!-- vale off -->\n Pin Chat Message additional fields\n\nUse the Additional Fields to further refine the behavior of the node. Select Add Field to add any of the following:\n\n Disable Notifications: By default, Telegram will notify all chat members that the message has been pinned. If you don't want these notifications to go out, turn this control on. Sets the disablenotification parameter to true.\n<!-- vale on -->\n\n Send Animation\n\nUse this operation to send GIFs or H.264/MPEG-4 AVC videos without sound up to 50 MB in size to the chat using the Bot API sendAnimation method.\n\nEnter these parameters:\n\n Credential to connect with: Create or select an existing Telegram credential.\n Resource: Select Message.\n Operation: Select Send Animation.\n Chat ID: Enter the Chat ID or username of the channel you wish to send the animation to in the format @channelusername.\n     To feed a Chat ID directly into this node, use the Telegram Trigger node. Refer to Common Issues | Get the Chat ID for more information.\n Binary File: To send a binary file from the node itself, turn this option on. If you turn this parameter on, you must enter the Input Binary Field containing the file you want to send.\n Animation: If you aren't using the Binary File, enter the animation to send here. Pass a fileid to send a file that exists on the Telegram servers (recommended) or an HTTP URL for Telegram to get a file from the internet.\n Reply Markup: Use this parameter to set more interface options. Refer to Reply Markup parameters for more information on these options and how to use them.\n\nRefer to the Telegram Bot API sendAnimation documentation for more information.\n\n<!-- vale off -->\n Send Animation additional fields\n\nUse the Additional Fields to further refine the behavior of the node using optional fields in Telegram's sendAnimation method. Select Add Field to add any of the following:\n\n Caption: Enter a caption text for the animation, max of 1024 characters.\n Disable Notification: Choose whether to send the notification silently (turned on) or with a standard notification (turned off).\n Duration: Enter the animation's duration in seconds.\n Height: Enter the height of the animation.\n Parse Mode: Enter the parser to use for any related text. Options include HTML (default), Markdown (Legacy), MarkdownV2. Refer to Telegram's Formatting options for more information on these options.\n Reply To Message ID: If the message is a reply, enter the ID of the message it's replying to.\n Message Thread ID: Enter a unique identifier for the target message thread (topic) of the forum; for forum supergroups only.\n Thumbnail: Add the thumbnail of the file sent. Ignore this field if thumbnail generation for the file is supported server-side. The thumbnail should meet these specs:\n     JPEG format\n     Less than 200 KB in size\n     Width and height less than 320px.\n Width: Enter the width of the video clip.\n\n<!-- vale on -->\n\n Send Audio\n\nUse this operation to send an audio file to the chat and display it in the music player using the Bot API sendAudio method.\n\nEnter these parameters:\n\n Credential to connect with: Create or select an existing Telegram credential.\n Resource: Select Message.\n Operation: Select Send Audio.\n Chat ID: Enter the Chat ID or username of the channel you wish to send the audio to in the format @channelusername.\n     To feed a Chat ID directly into this node, use the Telegram Trigger node. Refer to Common Issues | Get the Chat ID for more information.\n Binary File: To send a binary file from the node itself, turn this option on. If you turn this parameter on, you must enter the Input Binary Field containing the file you want to send.\n Audio: If you aren't using the Binary File, enter the audio to send here. Pass a fileid to send a file that exists on the Telegram servers (recommended) or an HTTP URL for Telegram to get a file from the internet.\n Reply Markup: Use this parameter to set more interface options. Refer to Reply Markup parameters for more information on these options and how to use them.\n\nRefer to the Telegram Bot API sendAudio documentation for more information.\n\n<!-- vale off -->\n Send Audio additional fields\n\nUse the Additional Fields to furthe",
  "category": "app-nodes",
  "nodeType": "telegram",
  "keywords": [
    "telegram",
    "node",
    "message",
    "operations",
    "send",
    "enter",
    "chat",
    "this",
    "reply",
    "select",
    "more",
    "refer"
  ],
  "fetchedAt": "2025-10-07T16:14:56.119Z",
  "hash": "30e2bcfe1e16cea5aae1770e9bf45a2b"
}