{
  "title": "Send Email",
  "url": "https://docs.n8n.io/integrations/builtin/core-nodes/n8n-nodes-base.sendemail",
  "content": "---\ntitle: Send Email\ndescription: Documentation for the Send Email node in n8n, a workflow automation platform. Includes guidance on usage, and links to examples.\ncontentType: [integration, reference]\npriority: high\n---\n\n Send Email\n\nThe Send Email node sends emails using an SMTP email server.\n\n/// note | Credential\nYou can find authentication information for this node here.\n///\n\n Node parameters\n\n--8<-- \"snippets/integrations/builtin/app-nodes/ai-tools.md\"\n\nConfigure this node using the following parameters.\n\n Credential to connect with\n\nSelect or create an SMTP account credential for the node to use.\n\n Operation\n\nThe Send Email node supports the following operations:\n\n Send: Send an email.\n Send and Wait for Response: Send an email and wait for a response from the receiver. This operation pauses the workflow execution until the user submits a response.\n\nChoosing Send and Wait for Response will activate parameters and options as discussed in waiting for a response.\n\n From Email\n\nEnter the email address you want to send the email from. You can also include a name using this format: Name Name <email@sample.com>, for example: Nathan Doe <nate@n8n.io>.\n\n To Email\n\nEnter the email address you want to send the email to. You can also include a name using this format: Name Name <email@sample.com>, for example: Nathan Doe <nate@n8n.io>. Use a comma to separate multiple email addresses: first@sample.com, \"Name\" <second@sample.com>.\n\n/// note | Email Format\nThis email format also applies to the CC and BCC fields.\n///\n\n Subject\n\nEnter the subject line for the email.\n\n Email Format\n\nSelect the format to send the email in. This parameter is available when using the Send operation. Choose from:\n\n Text: Send the email in plain-text format.\n HTML: Send the email in HTML format.\n Both: Send the email in both formats. If you choose this option, the email recipient's client will set which format to display.\n\n Node options\n\nUse these Options to further refine the node's behavior.\n\n Append n8n Attribution\n\nSet whether to include the phrase This email was sent automatically with n8n at the end of the email (turned on) or not (turned off).\n\n Attachments\n\nEnter the name of the binary properties that contain data to add as an attachment. Some tips on using this option:\n\n Use the Read/Write Files from Disk node or the HTTP Request node to upload the file to your workflow.\n Add multiple attachments by entering a comma-separated list of binary properties.\n Reference embedded images or other content within the body of an email message, for example <img src=\"cid:image1\">.\n\n CC Email\n\nEnter an email address for the cc: field.\n\n BCC Email\n\nEnter an email address for the bcc: field.\n\n Ignore SSL Issues\n\nSet whether n8n should ignore failures with TLS/SSL certificate validation (turned on) or enforce them (turned off).\n\n Reply To\n\nEnter an email address for the Reply To field.\n\n Waiting for a response\n\nBy choosing the Send and Wait for a Response operation, you can send an email message and pause the workflow execution until a person confirms the action or provides more information.\n\n Response Type\n\nYou can choose between the following types of waiting and approval actions:\n\n Approval: Users can approve or disapprove from within the message.\n Free Text: Users can submit a response with a form.\n Custom Form: Users can submit a response with a custom form.\n\nDifferent options are available depending on which type you choose.\n\n Approval parameters and options\n\nWhen using the Approval response type, the following options are available:\n\n Type of Approval: Whether to present only an approval button or both an approval and disapproval buttons.\n Button Label: The label for the approval or disapproval button. The default choice is Approve and Decline for approval and disapproval actions respectively.\n Button Style: The style (primary or secondary) for the button.\n\nThis mode also offers the following options:\n\n Limit Wait Time: Whether the workflow will automatically resume execution after a specified time limit. This can be an interval or a specific wall time.\n Append n8n Attribution: Set whether to include the phrase This email was sent automatically with n8n at the end of the email (turned on) or not (turned off).\n\n Free Text parameters and options\n\nWhen using the Free Text response type, the following options are available:\n\n Message Button Label: The label to use for message button. The default choice is Respond.\n Response Form Title: The title of the form where users provide their response.\n Response Form Description: A description for the form where users provide their response.\n Response Form Button Label: The label for the button on the form to submit their response. The default choice is Submit.\n Limit Wait Time: Whether the workflow will automatically resume execution after a specified time limit. This can be an interval or a specific wall time.\n Append n8n Attribution: Set whether to include the phrase This email was sent automatically with n8n at the end of the email (turned on) or not (turned off).\n\n Custom Form parameters and options\n\nWhen using the Custom Form response type, you build a form using the fields and options you want.\n\nYou can customize each form element with the settings outlined in the n8n Form trigger's form elements. To add more fields, select the Add Form Element button.\n\nThe following options are also available:\n\n Message Button Label: The label to use for message button. The default choice is Respond.\n Response Form Title: The title of the form where users provide their response.\n Response Form Description: A description for the form where users provide their response.\n Response Form Button Label: The label for the button on the form to submit their response. The default choice is Submit.\n Limit Wait Time: Whether the workflow will automatically resume execution after a specified time limit. This can be an interval or a specific wall time.\n Append n8n Attribution: Set whether to include the phrase This email was sent automatically with n8n at the end of the email (turned on) or not (turned off).\n\n Templates and examples\n\n<!-- see https://www.notion.so/n8n/Pull-in-templates-for-the-integrations-pages-37c716837b804d30a33b47475f6e3780 -->\n[[ templatesWidget(page.title, 'send-email') ]]",
  "category": "core-nodes",
  "nodeType": "n8n-nodes-base.sendemail.md",
  "keywords": [
    "send",
    "email",
    "response",
    "form",
    "this",
    "button",
    "options",
    "node",
    "using",
    "turned"
  ],
  "fetchedAt": "2025-10-07T16:14:11.106Z",
  "hash": "31edbd8033ada3c6d6e62f28599e0634"
}