{
  "title": "Milvus Vector Store node",
  "url": "https://docs.n8n.io/integrations/builtin/cluster-nodes/root-nodes/n8n-nodes-langchain.vectorstoremilvus",
  "content": "---\ntitle: Milvus Vector Store node documentation\ndescription: Learn how to use the Milvus Vector Store node in n8n. Follow technical documentation to integrate Milvus Vector Store node into your workflows.\ncontentType: [integration, reference]\npriority: medium\n---\n\n Milvus Vector Store node\n\nUse the Milvus node to interact with your Milvus database as vector store. You can insert documents into a vector database, get documents from a vector database, retrieve documents to provide them to a retriever connected to a chain, or connect directly to an agent as a tool.\n\nOn this page, you'll find the node parameters for the Milvus node, and links to more resources.\n\n/// note | Credentials\nYou can find authentication information for this node here.\n///\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/sub-node-expression-resolution.md\"\n\n Node usage patterns\n\nYou can use the Milvus Vector Store node in the following patterns.\n\n Use as a regular node to insert and retrieve documents\n\nYou can use the Milvus Vector Store as a regular node to insert, or get documents. This pattern places the Milvus Vector Store in the regular connection flow without using an agent.\n\nSee this example template for how to build a system that stores documents in Milvus and retrieves them to support cited, chat-based answers.\n\n Connect directly to an AI agent as a tool\n\nYou can connect the Milvus Vector Store node directly to the tool connector of an AI agent to use a vector store as a resource when answering queries.\n\nHere, the connection would be: AI agent (tools connector) -> Milvus Vector Store node. See this example template where data is embedded and indexed in Milvus, and the AI Agent uses the vector store as a knowledge tool for question-answering.\n\n Use a retriever to fetch documents\n\nYou can use the Vector Store Retriever node with the Milvus Vector Store node to fetch documents from the Milvus Vector Store node. This is often used with the Question and Answer Chain node to fetch documents from the vector store that match the given chat input.\n\nA typical node connection flow looks like this: Question and Answer Chain (Retriever connector) -> Vector Store Retriever (Vector Store connector) -> Milvus Vector Store.\n\nCheck out this workflow example to see how to ingest external data into Milvus and build a chat-based semantic Q&A system.\n\n Use the Vector Store Question Answer Tool to answer questions\n\nAnother pattern uses the Vector Store Question Answer Tool to summarize results and answer questions from the Milvus Vector Store node. Rather than connecting the Milvus Vector Store directly as a tool, this pattern uses a tool specifically designed to summarizes data in the vector store.\n\nThe connections flow would look like this: AI agent (tools connector) -> Vector Store Question Answer Tool (Vector Store connector) -> Milvus Vector store.\n\n Node parameters\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/vector-store-mode.md\"\n\n Rerank Results\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/vector-store-rerank-results.md\"\n\n<!-- vale from-write-good.Weasel = NO -->\n Get Many parameters\n<!-- vale from-write-good.Weasel = YES -->\n\n Milvus Collection: Select or enter the Milvus Collection to use.\n Prompt: Enter your search query.\n Limit: Enter how many results to retrieve from the vector store. For example, set this to 10 to get the ten best results.\n\n Insert Documents parameters\n\n Milvus Collection: Select or enter the Milvus Collection to use.\n Clear Collection: Specify whether to clear the collection before inserting new documents.\n\n Retrieve Documents (As Vector Store for Chain/Tool) parameters\n\n Milvus collection: Select or enter the Milvus Collection to use.\n\n Retrieve Documents (As Tool for AI Agent) parameters\n\n Name: The name of the vector store.\n Description: Explain to the LLM what this tool does. A good, specific description allows LLMs to produce expected results more often.\n Milvus Collection: Select or enter the Milvus Collection to use.\n Limit: Enter how many results to retrieve from the vector store. For example, set this to 10 to get the ten best results.\n\n Node options\n\n Metadata Filter\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/langchain-root-nodes/vector-store-metadata-filter.md\"\n\n Clear Collection\n\nAvailable in Insert Documents mode. Deletes all data from the collection before inserting the new data.\n\n Related resources\n\nRefer to LangChain's Milvus documentation for more information about the service.\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/langchain-overview-link.md\"",
  "category": "cluster-nodes",
  "nodeType": "n8n-nodes-langchain.vectorstoremilvus.md",
  "keywords": [
    "milvus",
    "vector",
    "store",
    "node",
    "documents",
    "this",
    "tool",
    "collection",
    "from",
    "agent"
  ],
  "fetchedAt": "2025-10-07T16:15:26.399Z",
  "hash": "3249ce3616e7a9a6ca402b4ba9323428"
}