{
  "title": "Gmail node Draft Operations",
  "url": "https://docs.n8n.io/integrations/builtin/app-nodes/n8n-nodes-base.gmail/draft-operations",
  "content": "---\ntitle: Gmail node Draft Operations documentation\ndescription: Learn how to use the Draft Operations of the Gmail node in n8n. Follow technical documentation to integrate Draft Operations into your workflows.\ncontentType: [integration, reference]\npriority: high\n---\n\n Gmail node Draft Operations\n\nUse the Draft operations to create, delete, or get a draft or list drafts in Gmail. Refer to the Gmail node for more information on the Gmail node itself.\n\n Create a draft\n\nUse this operation to create a new draft.\n\nEnter these parameters:\n\n Select the Credential to connect with or create a new one.\n Resource: Select Draft.\n Operation: Select Create.\n Subject: Enter the subject line.\n Select the Email Type. Choose from Text or HTML.\n Message: Enter the email message body.\n\n Create draft options\n\nUse these options to further refine the node's behavior:\n\n Attachments: Select Add Attachment to add an attachment. Enter the Attachment Field Name (in Input) to identify which field from the input node contains the attachment.\n     For multiple properties, enter a comma-separated list.\n BCC: Enter one or more email addresses for blind copy recipients. Separate multiple email addresses with a comma, for example jay@gatsby.com, jon@smith.com.\n CC: Enter one or more email addresses for carbon copy recipients. Separate multiple email addresses with a comma, for example jay@gatsby.com, jon@smith.com.\n From Alias Name or ID: Select an alias to send the draft from. This field populates based on the credential you selected in the parameters.\n Send Replies To: Enter an email address to set as the reply to address.\n Thread ID: If you want this draft attached to a thread, enter the ID for that thread.\n To Email: Enter one or more email addresses for recipients. Separate multiple email addresses with a comma, for example jay@gatsby.com, jon@smith.com.\n\nRefer to the Gmail API Method: users.drafts.create documentation for more information.\n\n Delete a draft\n\nUse this operation to delete a draft.\n\nEnter these parameters:\n\n Select the Credential to connect with or create a new one.\n Resource: Select Draft.\n Operation: Select Delete.\n Draft ID: Enter the ID of the draft you wish to delete.\n\nRefer to the Gmail API Method: users.drafts.delete documentation for more information.\n\n Get a draft\n\nUse this operation to get a single draft.\n\nEnter these parameters:\n\n Select the Credential to connect with or create a new one.\n Resource: Select Draft.\n Operation: Select Get.\n Draft ID: Enter the ID of the draft you wish to get information about.\n\n Get draft options\n\nUse these options to further refine the node's behavior:\n\n Attachment Prefix: Enter a prefix for the name of the binary property the node should write any attachments to. n8n adds an index starting with 0 to the prefix. For example, if you enter attachment' as the prefix, the first attachment saves to 'attachment0'.\n Download Attachments: Select whether the node should download the draft's attachments (turned on) or not (turned off).\n\nRefer to the Gmail API Method: users.drafts.get documentation for more information.\n\n<!-- vale off -->\n Get Many drafts\n<!-- vale on -->\n\nUse this operation to get two or more drafts.\n\nEnter these parameters:\n\n Select the Credential to connect with or create a new one.\n Resource: Select Draft.\n Operation: Select Get Many.\n Return All: Choose whether the node returns all drafts (turned on) or only up to a set limit (turned off).\n Limit: Enter the maximum number of drafts to return. Only used if you've turned off Return All.\n\n<!-- vale off -->\n Get Many drafts options\n<!-- vale on -->\n\nUse these options to further refine the node's behavior:\n\n Attachment Prefix: Enter a prefix for the name of the binary property the node should write any attachments to. n8n adds an index starting with 0 to the prefix. For example, if you enter attachment' as the prefix, the first attachment saves to 'attachment0'.\n Download Attachments: Select whether the node should download the draft's attachments (turned on) or not (turned off).\n Include Spam and Trash: Select whether the node should get drafts in the Spam and Trash folders (turned on) or not (turned off).\n\nRefer to the Gmail API Method: users.drafts.list documentation for more information.\n\n Common issues\n\nFor common errors or issues and suggested resolution steps, refer to Common Issues.",
  "category": "app-nodes",
  "nodeType": "gmail",
  "keywords": [
    "gmail",
    "node",
    "draft",
    "operations",
    "enter",
    "select",
    "drafts",
    "create",
    "email",
    "attachment",
    "more"
  ],
  "fetchedAt": "2025-10-07T16:14:28.210Z",
  "hash": "3b98d8978880c653be090e2a5c63c39f"
}