{
  "title": "Respond to Webhook",
  "url": "https://docs.n8n.io/integrations/builtin/core-nodes/n8n-nodes-base.respondtowebhook",
  "content": "---\ntitle: Respond to Webhook\ndescription: Documentation for the Respond to Webhook node in n8n, a workflow automation platform. Includes guidance on usage, and links to examples.\ncontentType: [integration, reference]\npriority: critical\n---\n\n Respond to Webhook\n\nUse the Respond to Webhook node to control the response to incoming webhooks. This node works with the Webhook node.\n\n/// note | Runs once for the first data item\nThe Respond to Webhook node runs once, using the first incoming data item. Refer to Return more than one data item for more information.\n///\n\n How to use Respond to Webhook\n\nTo use the Respond to Webhook node:\n\n1. Add a Webhook node as the trigger node for the workflow.\n1. In the Webhook node, set Respond to Using 'Respond to Webhook' node.\n1. Add the Respond to Webhook node anywhere in your workflow. If you want it to return data from other nodes, place it after those nodes.\n\n Node parameters\n\nConfigure the node behavior using these parameters.\n\n Respond With\n\nChoose what data to send in the webhook response.\n\n- All Incoming Items: Respond with all the JSON items from the input.\n- Binary File: Respond with a binary file defined in Response Data Source.\n- First Incoming Item: Respond with the first incoming item's JSON.\n- JSON: Respond with a JSON object defined in Response Body.\n- JWT Token: Respond with a JSON Web Token (JWT).\n- No Data: No response payload.\n- Redirect: Redirect to a URL set in Redirect URL.\n- Text: Respond with text set in Response Body. This sends HTML by default (Content-Type: text/html).\n\n Node options\n\nSelect Add Option to view and set the options.\n\n- Response Code: Set the response code to use.\n- Response Headers: Define the response headers to send.\n- Put Response in Field: Available when you respond with All Incoming Items or First Incoming Item. Set the field name for the field containing the response data.\n- Enable Streaming: When enabled, sends the data back to the user using streaming. Requires a trigger configured with the Response mode Streaming.\n\n How n8n secures HTML responses\n\nStarting with n8n version 1.103.0, n8n automatically wraps HTML responses to webhooks in <iframe> tags. This is a security mechanism to protect the instance users.\n\nThis has the following implications:\n\n- HTML renders in a sandboxed iframe instead of directly in the parent document.\n- JavaScript code that attempts to access the top-level window or local storage will fail.\n- Authentication headers aren't available in the sandboxed iframe (for example, basic auth). You need to use an alternative approach, like embedding a short-lived access token within the HTML.\n- Relative URLs (for example, <form action=\"/\">) won't work. Use absolute URLs instead.\n\n Templates and examples\n\n<!-- see https://www.notion.so/n8n/Pull-in-templates-for-the-integrations-pages-37c716837b804d30a33b47475f6e3780 -->\n[[ templatesWidget(page.title, 'respond-to-webhook') ]]\n\n Workflow behavior\n\nWhen using the Respond to Webhook node, workflows behave as follows:\n\n- The workflow finishes without executing the Respond to Webhook node: it returns a standard message with a 200 status.\n- The workflow errors before the first Respond to Webhook node executes: the workflow returns an error message with a 500 status.\n- A second Respond to Webhook node executes after the first one: the workflow ignores it.\n- A Respond to Webhook node executes but there was no webhook: the workflow ignores the Respond to Webhook node.\n\n Output the response sent to the webhook\n\nBy default, the Respond to Webhook node has a single output branch that contains the node's input data.\n\nYou can optionally enable a second output branch containing the response sent to the webhook. To enable this secondary output, open the Respond to Webhook node on the canvas and select the Settings tab. Activate the Enable Response Output Branch option.\n\nThe node will now have two outputs:\n\n Input Data: The original output, passing on the node's input.\n Response: The response object sent to the webhook.\n\n Return more than one data item (deprecated)\n\n/// note | Deprecated in 1.22.0\nn8n 1.22.0 added support for returning all data items using the All Incoming Items option. n8n recommends upgrading to the latest version of n8n, instead of using the workarounds described in this section.\n///\n\nThe Respond to Webhook node runs once, using the first incoming data item. This includes when using expressions. You can't force looping using the Loop node: the workflow will run, but the webhook response will still only contain the results of the first execution.\n\nIf you need to return more than one data item, choose one of these options:\n\n- Instead of using the Respond to Webhook node, use the When Last Node Finishes option in Respond in the Webhook node. Use this when you want to return the final data that the workflow outputs.\n- Use the Aggregate node to turn multiple items into a single item before passing the data to the Respond to Webhook node. Set Aggregate to All Item Data (Into a Single List).",
  "category": "core-nodes",
  "nodeType": "n8n-nodes-base.respondtowebhook.md",
  "keywords": [
    "respond",
    "webhook",
    "node",
    "response",
    "data",
    "with",
    "workflow",
    "item",
    "using",
    "incoming"
  ],
  "fetchedAt": "2025-10-07T16:14:10.131Z",
  "hash": "417d2225af9d8e07b8e7e05a99b9c8ea"
}