{
  "title": "Pinecone Vector Store node",
  "url": "https://docs.n8n.io/integrations/builtin/cluster-nodes/root-nodes/n8n-nodes-langchain.vectorstorepinecone",
  "content": "---\ntitle: Pinecone Vector Store node documentation\ndescription: Learn how to use the Pinecone Vector Store node in n8n. Follow technical documentation to integrate Pinecone Vector Store node into your workflows.\ncontentType: [integration, reference]\npriority: medium\n---\n\n Pinecone Vector Store node\n\nUse the Pinecone node to interact with your Pinecone database as vector store. You can insert documents into a vector database, get documents from a vector database, retrieve documents to provide them to a retriever connected to a chain, or connect directly to an agent as a tool. You can also update an item in a vector database by its ID.\n\nOn this page, you'll find the node parameters for the Pinecone node, and links to more resources.\n\n/// note | Credentials\nYou can find authentication information for this node here.\n///\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/sub-node-expression-resolution.md\"\n\n Node usage patterns\n\nYou can use the Pinecone Vector Store node in the following patterns.\n\n Use as a regular node to insert, update, and retrieve documents\n\nYou can use the Pinecone Vector Store as a regular node to insert, update, or get documents. This pattern places the Pinecone Vector Store in the regular connection flow without using an agent.\n\nYou can see an example of this in scenario 1 of this template.\n\n Connect directly to an AI agent as a tool\n\nYou can connect the Pinecone Vector Store node directly to the tool connector of an AI agent to use a vector store as a resource when answering queries.\n\nHere, the connection would be: AI agent (tools connector) -> Pinecone Vector Store node.\n\n Use a retriever to fetch documents\n\nYou can use the Vector Store Retriever node with the Pinecone Vector Store node to fetch documents from the Pinecone Vector Store node. This is often used with the Question and Answer Chain node to fetch documents from the vector store that match the given chat input.\n\nAn example of the connection flow would be: Question and Answer Chain (Retriever connector) -> Vector Store Retriever (Vector Store connector) -> Pinecone Vector Store.\n\n Use the Vector Store Question Answer Tool to answer questions\n\nAnother pattern uses the Vector Store Question Answer Tool to summarize results and answer questions from the Pinecone Vector Store node. Rather than connecting the Pinecone Vector Store directly as a tool, this pattern uses a tool specifically designed to summarizes data in the vector store.\n\nThe connections flow in this case would look like this: AI agent (tools connector) -> Vector Store Question Answer Tool (Vector Store connector) -> Pinecone Vector store.\n\t\n Node parameters\n\n Operation Mode\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/vector-store-mode-with-update.md\"\n\n Rerank Results\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/vector-store-rerank-results.md\"\n\n<!-- vale from-write-good.Weasel = NO -->\n Get Many parameters\n<!-- vale from-write-good.Weasel = YES -->\n\n Pinecone Index: Select or enter the Pinecone Index to use.\n Prompt: Enter your search query.\n Limit: Enter how many results to retrieve from the vector store. For example, set this to 10 to get the ten best results.\n\n Insert Documents parameters\n\n Pinecone Index: Select or enter the Pinecone Index to use.\n\n Retrieve Documents (As Vector Store for Chain/Tool) parameters\n\n Pinecone Index: Select or enter the Pinecone Index to use.\n\n Retrieve Documents (As Tool for AI Agent) parameters\n\n Name: The name of the vector store.\n Description: Explain to the LLM what this tool does. A good, specific description allows LLMs to produce expected results more often.\n Pinecone Index: Select or enter the Pinecone Index to use.\n Limit: Enter how many results to retrieve from the vector store. For example, set this to 10 to get the ten best results.\n\n Parameters for Update Documents\n\n ID\n\n Node options\n\n Pinecone Namespace \n\nAnother segregation option for how to store your data within the index.\n\n Metadata Filter\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/langchain-root-nodes/vector-store-metadata-filter.md\"\n\n Clear Namespace\n\nAvailable in Insert Documents mode. Deletes all data from the namespace before inserting the new data.\n\n Templates and examples\n\n<!-- see https://www.notion.so/n8n/Pull-in-templates-for-the-integrations-pages-37c716837b804d30a33b47475f6e3780 -->\n[[ templatesWidget(page.title, 'pinecone-vector-store') ]]\n\n Related resources\n\nRefer to LangChain's Pinecone documentation for more information about the service.\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/langchain-overview-link.md\"\n\n Find your Pinecone index and namespace\n\nYour Pinecone index and namespace are available in your Pinecone account.\n\n!Screenshot of a Pinecone account, with the Pinecone index labelled",
  "category": "cluster-nodes",
  "nodeType": "n8n-nodes-langchain.vectorstorepinecone.md",
  "keywords": [
    "pinecone",
    "vector",
    "store",
    "node",
    "documents",
    "this",
    "index",
    "tool",
    "from",
    "results"
  ],
  "fetchedAt": "2025-10-07T16:15:26.855Z",
  "hash": "52afb5d9a4ccb70b120b58a371c612ef"
}