{
  "title": "Date & Time",
  "url": "https://docs.n8n.io/integrations/builtin/core-nodes/n8n-nodes-base.datetime",
  "content": "---\ntitle: Date & Time\ndescription: Documentation for the Date & Time node in n8n, a workflow automation platform. Includes guidance on usage, and links to examples.\ncontentType: [integration, reference]\npriority: high\n---\n\n Date & Time\n\nThe Date & Time node manipulates date and time data and convert it to different formats.\n\n--8<-- \"snippets/integrations/builtin/core-nodes/schedule/timezone-settings.md\"\n\n/// note | Date and time in other nodes\nYou can work with data and time in the Code node, and in expressions in any node. n8n supports Luxon to help work with date and time in JavaScript. Refer to Date and time with Luxon for more information.\n///\n\n Operations\n\n Add to a Date: Add a specified amount of time to a date.\n Extract Part of a Date: Extract part of a date, such as the year, month, or day.\n Format a Date: Transform a date's format to a new format using preset options or a custom expression.\n Get Current Date: Get the current date and choose whether to include the current time or not. Useful for triggering other flows and conditional logic.\n Get Time Between Dates: Calculate the amount of time in specific units between two dates.\n Round a Date: Round a date up or down to the nearest unit of your choice, such as month, day, or hour.\n Subtract From a Date: Subtract a specified amount of time from a date.\n\nRefer to the sections below for parameters and options specific to each operation.\n\n Add to a Date\n\nConfigure the node for this operation using these parameters:\n\n Date to Add To: Enter the date you want to change.\n Time Unit to Add: Select the time unit for the Duration parameter.\n Duration: Enter the number of time units to add to the date.\n Output Field Name: Enter the name of the field to output the new date to.\n\n Add to a Date options\n\nThis operation has one option: Include Input Fields. If you'd like to include all of the input fields in the output, turn this option on. If turned off, only the Output Field Name and its contents are output.\n\n Extract Part of a Date\n\nConfigure the node for this operation using these parameters:\n\n Date: Enter the date you want to round or extract part of.\n Part: Select the part of the date you want to extract. Choose from:\n     Year\n     Month\n     Week\n     Day\n     Hour\n     Minute\n     Second\n Output Field Name: Enter the name of the field to output the extracted date part to.\n\n Extract Part of a Date options\n\nThis operation has one option: Include Input Fields. If you'd like to include all of the input fields in the output, turn this option on. If turned off, only the Output Field Name and its contents are output.\n\n Format a Date\n\nConfigure the node for this operation using these parameters:\n\n Date: Enter the date you want to format.\n Format: Select the format you want to change the date to. Choose from:\n     Custom Format: Enter your own custom format using Luxon's special tokens. Tokens are case-sensitive.\n     MM/DD/YYYY: For 4 September 1986, this formats the date as 09/04/1986.\n     YYYY/MM/DD: For 4 September 1986, this formats the date as 1986/09/04.\n     MMMM DD YYYY: For 4 September 1986, this formats the date as September 04 1986.\n     MM-DD-YYYY: For 4 September 1986, this formats the date as 09-04-1986.\n     YYYY-MM-DD: For 4 September 1986, this formats the date as 1986-09-04.\n Output Field Name: Enter the name of the field to output the formatted date to.\n\n Format a Date options\n\nThis operation includes these options:\n\n Include Input Fields: If you'd like to include all of the input fields in the output, turn this option on. If turned off, only the Output Field Name and its contents are output.\n From Date Format: If the node isn't recognizing the Date format correctly, enter the format for that Date here so the node can process it properly. Use Luxon's special tokens to enter the format. Tokens are case-sensitive\n Use Workflow Timezone: Whether to use the input's time zone (turned off) or the workflow's timezone (turned on).\n\n Get Current Date\n\nConfigure the node for this operation using these parameters:\n\n Include Current Time: Choose whether to include the current time (turned on) or to set the time to midnight (turned off).\n Output Field Name: Enter the name of the field to output the current date to.\n\n Get Current Date options\n\nThis operation includes these options:\n\n Include Input Fields: If you'd like to include all of the input fields in the output, turn this option on. If turned off, only the Output Field Name and its contents are output.\n Timezone: Set the timezone to use. If left blank, the node uses the n8n instance's timezone.\n\n/// note | +00:00 timezone\nUse GMT for +00:00 timezone.\n///\n\n Get Time Between Dates\n\nConfigure the node for this operation using these parameters:\n\n Start Date: Enter the earlier date you want to compare.\n End Date: Enter the later date you want to compare.\n Units: Select the units you want to calculate the time between. You can include multiple units. Choose from:\n     Year\n     Month\n     Week\n     Day\n     Hour\n     Minute\n     Second\n     Millisecond\n Output Field Name: Enter the name of the field to output the calculated time between to.\n\n Get Time Between Dates options\n\nThe Get Time Between Dates operation includes the Include Input Fields option as well as an Output as ISO String option. If you leave this option off, each unit you selected will return its own time difference calculation, for example:\n\n    timeDifference\n    years : 1\n    months : 3\n    days : 13\n\nIf you turn on the Output as ISO String option, the node formats the output as a single ISO duration string, for example: P1Y3M13D.\n\nISO duration format displays a format as P<n>Y<n>M<n>DT<n>H<n>M<n>S. <n> is the number for the unit after it.\n\n P = period (duration). It begins all ISO duration strings.\n Y = years\n M = months\n W = weeks\n D = days\n T = delineator between dates and times, used to avoid confusion between months and minutes\n H = hours\n M = minutes\n S = seconds\n\nMilliseconds don't get their own unit, but instead are decimal seconds. For example, 2.1 milliseconds is 0.0021S.\n\n Round a Date\n\nConfigure the node for this operation using these parameters:\n\n Date: Enter the date you'd like to round.\n Mode: Choose whether to Round Down or Round Up.\n To Nearest: Select the unit you'd like to round to. Choose from:\n     Year\n     Month\n     Week\n     Day\n     Hour\n     Minute\n     Second\n Output Field Name: Enter the name of the field to output the rounded date to.\n\n Round a Date options\n\nThis operation has one option: Include Input Fields. If you'd like to include all of the input fields in the output, turn this option on. If turned off, only the Output Field Name and its contents are output.\n\n Subtract From a Date\n\nConfigure the node for this operation using these parameters:\n\n Date to Subtract From: Enter the date you'd like to subtract from.\n Time Unit to Subtract: Select the unit for the Duration amount you want to subtract.\n Duration: Enter the amount of the time units you want to subtract from the Date to Subtract From.\n Output Field Name: Enter the name of the field to output the rounded date to.\n\n Subtract From a Date options\n\nThis operation has one option: Include Input Fields. If you'd like to include all of the input fields in the output, turn this option on. If turned off, only the Output Field Name and its contents are output.\n\n Templates and examples\n\n<!-- see https://www.notion.so/n8n/Pull-in-templates-for-the-integrations-pages-37c716837b804d30a33b47475f6e3780 -->\n[[ templatesWidget(page.title, 'date-and-time') ]]\n\n Related resources\n\nThe Date & Time node uses Luxon. You can also use Luxon in the Code node and expressions. Refer to Date and time with Luxon for more information.\n\n Supported date formats\n\nn8n supports all date formats supported by Luxon. Tokens are case-sensitive.",
  "category": "core-nodes",
  "nodeType": "n8n-nodes-base.datetime.md",
  "keywords": [
    "date",
    "time",
    "output",
    "this",
    "field",
    "name",
    "enter",
    "node",
    "include",
    "format"
  ],
  "fetchedAt": "2025-10-07T16:14:04.188Z",
  "hash": "552e812fe0ede82cce5cafd03054785e"
}