{
  "title": "Evaluation node",
  "url": "https://docs.n8n.io/integrations/builtin/core-nodes/n8n-nodes-base.evaluation",
  "content": "---\ntitle: Evaluation node documentation\ndescription: Documentation for the Evaluation node in n8n, a workflow automation platform. Includes guidance on usage and links to examples.\ncontentType: [integration, reference]\n---\n\n Evaluation node\n\nThe Evaluation node performs various operations related to evaluations to validate your AI workflow reliability.\n\nUse the Evaluation node in these scenarios:\n\n To conditionally execute logic based on whether the workflow is under evaluation\n To write evaluation outcomes back to a Google Sheet datasetor\n To log scoring metrics for your evaluation performance to n8n's evaluations tab\n\n/// note | Credentials for Google Sheets\nThe Evaluation node's Set Outputs operation records evaluation results to data tables or Google Sheets. To use Google Sheets as a recording location, configure a Google Sheets credential.\n///\n\n Operations\n\nThe Evaluation node offers the following operations:\n\n Set Outputs: Write the results of an evaluation back to a data table or Google Sheet dataset.\n Set Metrics: Record metrics scoring the evaluation performance to n8n's Evaluations tab.\n Check If Evaluating: Branches the workflow execution logic depending on whether the current execution is an evaluation.\n\nThe parameters and options available depend on the operation you select.\n\n Set Outputs\n\nThe Set Outputs operation has the following parameters:\n\n- Source: Select the location to which you want to output the evaluation results. Default value is Data table.\n\n   Source settings differ depending on Source selection.\n\n     When Source is Data table:\n         Data table: Select a data table by name or ID\n     When Source is Google Sheets:\n         Credential to connect with: Create or select an existing Google Sheets credentials.\n         Document Containing Dataset: Choose the spreadsheet document you want to write the evaluation results to. Usually this is the same document you select in the Evaluation Trigger node.\n         Select From list to choose the spreadsheet title from the dropdown list, By URL to enter the url of the spreadsheet, or By ID to enter the spreadsheetId. \n             You can find the spreadsheetId in a Google Sheets URL: https://docs.google.com/spreadsheets/d/spreadsheetId/editgid=0.\n         Sheet Containing Dataset: Choose the sheet you want to write the evaluation results to. Usually this is the same sheet you select in the Evaluation Trigger node.\n             Select From list to choose the sheet title from the dropdown list, By URL to enter the url of the sheet, By ID to enter the sheetId, or By Name to enter the sheet title. \n             You can find the sheetId in a Google Sheets URL: https://docs.google.com/spreadsheets/d/aBC-123xYz/editgid=sheetId. \n\nYou define the items to write to the data table or Google Sheet in the Outputs section. For each output, you set the following:\n\n Name: The Google Sheet column name to write the evaluation results to.\n Value: The value to write to the Google Sheet.\n\n Set Metrics\n\nThe Set Metrics operation includes a Metrics to Return section where you define the metrics to record and track for your evaluations. You can see the metric results in your workflow's Evaluations tab.\n\nFor each metric you wish to record, you set the following details:\n\n Name: The name to use for the metric.\n Value: The numeric value to record. Once you run your evaluation, you can drag and drop values from previous nodes here. Metric values must be numeric.\n\n Check If Evaluating\n\nThe Check If Evaluating operation doesn't have any parameters. This operation provides branching output connectors so that you can conditionally execute logic depending on whether the current execution is an evaluation or not.\n\n Templates and examples\n\n<!-- see https://www.notion.so/n8n/Pull-in-templates-for-the-integrations-pages-37c716837b804d30a33b47475f6e3780 -->\n[[ templatesWidget(page.title, 'evaluation') ]]\n\n Related resources\n\nTo learn more about n8n evaluations, check out the evaluations documentation\n\nn8n provides a trigger node for evaluations. You can find the node docs here.\n\nFor common questions or issues and suggested solutions, refer to the evaluations tips and common issues page.",
  "category": "core-nodes",
  "nodeType": "n8n-nodes-base.evaluation.md",
  "keywords": [
    "evaluation",
    "node",
    "google",
    "sheet",
    "evaluations",
    "sheets",
    "select",
    "write",
    "metrics",
    "results"
  ],
  "fetchedAt": "2025-10-07T16:14:04.912Z",
  "hash": "6dd015a3886f261f52f96465c1e6de62"
}