{
  "title": "Telegram Trigger node",
  "url": "https://docs.n8n.io/integrations/builtin/trigger-nodes/n8n-nodes-base.telegramtrigger/index",
  "content": "---\ntitle: Telegram Trigger node documentation\ndescription: Learn how to use the Telegram Trigger node in n8n. Follow technical documentation to integrate Telegram Trigger node into your workflows.\ncontentType: [integration, reference]\npriority: critical\n---\n\n Telegram Trigger node\n\nTelegram is a cloud-based instant messaging and voice over IP service. Users can send messages and exchange photos, videos, stickers, audio, and files of any type. On this page, you'll find a list of events the Telegram Trigger node can respond to and links to more resources.\n\n/// note | Credentials\nYou can find authentication information for this node here.\n///\n\n///  note  | Examples and templates\nFor usage examples and templates to help you get started, refer to n8n's Telegram Trigger integrations page.\n///\n\n Events\n\n- : All updates except \"Chat Member\", \"Message Reaction\", and \"Message Reaction Count\" (default behavior of Telegram API as they produces a lot of calls of updates).\n- Business Connection: Trigger when the bot is connected to or disconnected from a business account, or a user edited an existing connection with the bot.\n- Business Message: Trigger on a new message from a connected business account.\n- Callback Query: Trigger on new incoming callback query.\n- Channel Post: Trigger on new incoming channel post of any kind — including text, photo, sticker, and so on.\n- Chat Boost: Trigger when a chat boost is added or changed. The bot must be an administrator in the chat to receive these updates.\n- Chat Join Request: Trigger when a request to join the chat is sent. The bot must have the caninviteusers administrator right in the chat to receive these updates.\n- Chat Member: Trigger when a chat member's status is updated. The bot must be an administrator in the chat.\n- Chosen Inline Result: Trigger when the result of an inline query chosen by a user is sent. Please see Telegram's API documentation on feedback collection for details on how to enable these updates for your bot.\n- Deleted Business Messages: Trigger when messages are deleted from a connected business account.\n- Edited Business Message: Trigger on new version of a message from a connected business account.\n- Edited Channel Post: Trigger on new version of a channel post that is known to the bot is edited.\n- Edited Message: Trigger on new version of a channel post that is known to the bot is edited.\n- Inline Query: Trigger on new incoming inline query.\n- Message: Trigger on new incoming message of any kind — text, photo, sticker, and so on.\n- Message Reaction: Trigger when a reaction to a message is changed by a user. The bot must be an administrator in the chat. The update isn't received for reactions set by bots.\n- Message Reaction Count: Trigger when reactions to a message with anonymous reactions are changed. The bot must be an administrator in the chat. The updates are grouped and can be sent with delay up to a few minutes.\n- My Chat Member: Trigger when the bot's chat member status is updated in a chat. For private chats, this update is received only when the bot is blocked or unblocked by the user.\n- Poll: Trigger on new poll state. Bots only receive updates about stopped polls and polls which are sent by the bot.\n- Poll Answer: Trigger when user changes their answer in a non-anonymous poll. Bots only receive new votes in polls that were sent by the bot itself.\n- Pre-Checkout Query: Trigger on new incoming pre-checkout query. Contains full information about checkout.\n- Purchased Paid Media: Trigger when a user purchases paid media with a non-empty payload sent by the bot in a non-channel chat.\n- Removed Chat Boost: Trigger when a boost is removed from a chat. The bot must be an administrator in the chat to receive these updates.\n- Shipping Query: Trigger on new incoming shipping query. Only for invoices with flexible price.\n\nSome events may require additional permissions, see Telegram's API documentation for more information.\n\n Options\n\n- Download Images/Files: Whether to download attached images or files to include in the output data.\n\t- Image Size: When you enable Download Images/Files, this configures the size of image to download. Downloads large images by default.\n- Restrict to Chat IDs: Only trigger for events with the listed chat IDs. You can include multiple chat IDs separated by commas.\n- Restrict to User IDs: Only trigger for events with the listed user IDs. You can include multiple user IDs separated by commas.\n\n Related resources\n\nn8n provides an app node for Telegram. You can find the node docs here.\n\nView example workflows and related content on n8n's website.\n\nRefer to Telegram's API documentation for details about their API.\n\n Common issues\n\nFor common questions or issues and suggested solutions, refer to Common issues.",
  "category": "trigger-nodes",
  "nodeType": "telegram",
  "keywords": [
    "telegram",
    "trigger",
    "node",
    "chat",
    "when",
    "message",
    "user",
    "query",
    "updates",
    "business"
  ],
  "fetchedAt": "2025-10-07T16:15:19.461Z",
  "hash": "72c77e9f706cf1f4d8319b81f34cc7a7"
}