{
  "title": "Google Drive Shared Drive operations",
  "url": "https://docs.n8n.io/integrations/builtin/app-nodes/n8n-nodes-base.googledrive/shared-drive-operations",
  "content": "---\ntitle: Google Drive Shared Drive operations\ndescription: Documentation for the Shared Drive operations in Google Drive node in n8n, a workflow automation platform. Includes details of operations and configuration, and links to examples and credentials information.\ncontentType: [integration, reference]\npriority: high\n---\n\n Google Drive Shared Drive operations\n\nUse this operation to create, delete, get, and update shared drives in Google Drive. Refer to Google Drive for more information on the Google Drive node itself.\n\n--8<-- \"snippets/integrations/builtin/app-nodes/ai-tools.md\"\n\n Create a shared drive\n\nUse this operation to create a new shared drive.\n\nEnter these parameters:\n\n- Credential to connect with: Create or select an existing Google Drive credentials.\n- Resource: Select Shared Drive.\n- Operation: Select Create.\n- Name: The name to use for the new shared drive.\n\n Options\n\n- Capabilities: The capabilities to set for the new shared drive (see REST Resources: drives | Google Drive for more details):\n\t- Can Add Children: Whether the current user can add children to folders in this shared drive.\n\t- Can Change Copy Requires Writer Permission Restriction: Whether the current user can change the copyRequiresWriterPermission restriction on this shared drive.\n\t- Can Change Domain Users Only Restriction: Whether the current user can change the domainUsersOnly restriction on this shared drive.\n\t- Can Change Drive Background: Whether the current user can change the background on this shared drive.\n\t- Can Change Drive Members Only Restriction: Whether the current user can change the driveMembersOnly restriction on this shared drive.\n\t- Can Comment: Whether the current user can comment on files in this shared drive.\n\t- Can Copy: Whether the current user can copy files in this shared drive.\n\t- Can Delete Children: Whether the current user can delete children from folders in this shared drive.\n\t- Can Delete Drive: Whether the current user can delete this shared drive. This operation may still fail if there are items not in the trash in the shared drive.\n\t- Can Download: Whether the current user can download files from this shared drive.\n\t- Can Edit: Whether the current user can edit files from this shared drive.\n\t- Can List Children: Whether the current user can list the children of folders in this shared drive.\n\t- Can Manage Members: Whether the current user can add, remove, or change the role of members of this shared drive.\n\t- Can Read Revisions: Whether the current user can read the revisions resource of files in this shared drive.\n\t- Can Rename Drive: Whether the current user can rename this shared drive.\n\t- Can Share: Whether the current user can share files or folders in this shared drive.\n\t- Can Trash Children: Whether the current user can trash children from folders in this shared drive.\n- Color RGB: The color of this shared drive as an RGB hex string.\n- Hidden: Whether to hide this shared drive in the default view.\n- Restrictions: Restrictions to add to this shared drive (see REST Resources: drives | Google Drive for more details):\n\t- Admin Managed Restrictions: When enabled, restrictions here will override the similarly named fields to true for any file inside of this shared drive.\n\t- Copy Requires Writer Permission: Whether the options to copy, print, or download files inside this shared drive should be disabled for readers and commenters.\n\t- Domain Users Only: Whether to restrict access to this shared drive and items inside this shared drive to users of the domain to which this shared drive belongs.\n\t- Drive Members Only: Whether to restrict access to items inside this shared drive to its members.\n\nRefer to the Method: drives.insert | Google Drive API documentation for more information.\n\n Delete a shared drive\n\nUse this operation to delete a shared drive.\n\nEnter these parameters:\n\n- Credential to connect with: Create or select an existing Google Drive credentials.\n- Resource: Select Shared Drive.\n- Operation: Select Delete.\n- Shared Drive: Choose the shared drive want to delete. \n    - Select From list to choose the title from the dropdown list, By URL to enter the URL of the drive, or By ID to enter the driveId. \n    - You can find the driveId in the URL for the shared Google Drive: https://drive.google.com/drive/u/0/folders/driveID.\n\nRefer to the Method: drives.delete | Google Drive API documentation for more information.\n\n Get a shared drive\n\nUse this operation to get a shared drive.\n\nEnter these parameters:\n\n- Credential to connect with: Create or select an existing Google Drive credentials.\n- Resource: Select Shared Drive.\n- Operation: Select Get.\n- Shared Drive: Choose the shared drive want to get. \n    - Select From list to choose the title from the dropdown list, By URL to enter the URL of the drive, or By ID to enter the driveId. \n    - You can find the driveId in the URL for the shared Google Drive: https://drive.google.com/drive/u/0/folders/driveID.\n\n Options\n\n- Use Domain Admin Access: Whether to issue the request as a domain administrator. When enabled, grants the requester access if they're an administrator of the domain to which the shared drive belongs.\n\nRefer to the Method: drives.get | Google Drive API documentation for more information.\n\n<!-- vale from-write-good.Weasel = NO -->\n Get many shared drives\n\nUse this operation to get many shared drives.\n<!-- vale from-write-good.Weasel = YES -->\n\nEnter these parameters:\n\n- Credential to connect with: Create or select an existing Google Drive credentials.\n- Resource: Select Shared Drive.\n- Operation: Select Get Many.\n- Return All: Choose whether to return all results or only up to a given limit.\n- Limit: The maximum number of items to return when Return All is disabled.\n- Shared Drive: Choose the shared drive want to get. \n    - Select From list to choose the title from the dropdown list, By URL to enter the URL of the drive, or By ID to enter the driveId. \n    - You can find the driveId in the URL for the shared Google Drive: https://drive.google.com/drive/u/0/folders/driveID.\n\n Options\n\n- Query: The query string to use to search for shared drives. See Search for shared drives | Google Drive for more information.\n- Use Domain Admin Access: Whether to issue the request as a domain administrator. When enabled, grants the requester access if they're an administrator of the domain to which the shared drive belongs.\n\nRefer to the Method: drives.get | Google Drive API documentation for more information.\n\n Update a shared drive\n\nUse this operation to update a shared drive.\n\nEnter these parameters:\n\n- Credential to connect with: Create or select an existing Google Drive credentials.\n- Resource: Select Shared Drive.\n- Operation: Select Update.\n- Shared Drive: Choose the shared drive you want to update. \n    - Select From list to choose the drive from the dropdown list, By URL to enter the URL of the drive, or By ID to enter the driveId. \n    - You can find the driveId in the URL for the shared Google Drive: https://drive.google.com/drive/u/0/folders/driveID.\n\n Update Fields\n\n- Color RGB: The color of this shared drive as an RGB hex string.\n- Name: The updated name for the shared drive.\n- Restrictions: Restrictions for this shared drive (see REST Resources: drives | Google Drive for more details):\n\t- Admin Managed Restrictions: When enabled, restrictions here will override the similarly named fields to true for any file inside of this shared drive.\n\t- Copy Requires Writer Permission: Whether the options to copy, print, or download files inside this shared drive should be disabled for readers and commenters.\n\t- Domain Users Only: Whether to restrict access to this shared drive and items inside this shared drive to users of the domain to which this shared drive belongs.\n\t- Drive Members Only: Whether to restrict access to items inside this shared drive to its members.\n\nRefer to the Method: drives.update | Google Drive API documentation for more information.",
  "category": "app-nodes",
  "nodeType": null,
  "keywords": [
    "google",
    "drive",
    "shared",
    "operations",
    "this",
    "whether",
    "select",
    "current",
    "user",
    "from",
    "drives"
  ],
  "fetchedAt": "2025-10-07T16:14:32.444Z",
  "hash": "87ab7ed311f42d6526d89bdb4ebe31fa"
}