{
  "title": "Zep Vector Store node",
  "url": "https://docs.n8n.io/integrations/builtin/cluster-nodes/root-nodes/n8n-nodes-langchain.vectorstorezep",
  "content": "---\ntitle: Zep Vector Store node documentation\ndescription: Learn how to use the Zep Vector Store node in n8n. Follow technical documentation to integrate Zep Vector Store node into your workflows.\ncontentType: [integration, reference]\n---\n\n Zep Vector Store node\n\n/// warning | Deprecated\nThis node is deprecated, and will be removed in a future version. \n///\n\nUse the Zep Vector Store to interact with Zep vector databases. You can insert documents into a vector database, get documents from a vector database, retrieve documents to provide them to a retriever connected to a chain, or connect it directly to an agent to use as a tool.\n\nOn this page, you'll find the node parameters for the Zep Vector Store node, and links to more resources.\n\n/// note | Credentials\nYou can find authentication information for this node here.\n///\n\n/// note | Examples and templates\nFor usage examples and templates to help you get started, refer to n8n's Zep Vector Store integrations page.\n///\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/sub-node-expression-resolution.md\"\n\n Node usage patterns\n\nYou can use the Zep Vector Store node in the following patterns.\n\n Use as a regular node to insert, update, and retrieve documents\n\nYou can use the Zep Vector Store as a regular node to insert or get documents. This pattern places the Zep Vector Store in the regular connection flow without using an agent.\n\nYou can see an example of this in scenario 1 of this template (the example uses Supabase, but the pattern is the same).\n\n Connect directly to an AI agent as a tool\n\nYou can connect the Zep Vector Store node directly to the tool connector of an AI agent to use a vector store as a resource when answering queries.\n\nHere, the connection would be: AI agent (tools connector) -> Zep Vector Store node.\n\n Use a retriever to fetch documents\n\nYou can use the Vector Store Retriever node with the Zep Vector Store node to fetch documents from the Zep Vector Store node. This is often used with the Question and Answer Chain node to fetch documents from the vector store that match the given chat input.\n\nAn example of the connection flow (the example uses Pinecone, but the pattern in the same) would be: Question and Answer Chain (Retriever connector) -> Vector Store Retriever (Vector Store connector) -> Zep Vector Store.\n\n Use the Vector Store Question Answer Tool to answer questions\n\nAnother pattern uses the Vector Store Question Answer Tool to summarize results and answer questions from the Zep Vector Store node. Rather than connecting the Zep Vector Store directly as a tool, this pattern uses a tool specifically designed to summarizes data in the vector store.\n\nThe connections flow (this example uses Supabase, but the pattern is the same) in this case would look like this: AI agent (tools connector) -> Vector Store Question Answer Tool (Vector Store connector) -> Zep Vector store.\n\t\n Node parameters\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/vector-store-mode.md\"\n\n Rerank Results\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/vector-store-rerank-results.md\"\n\n Insert Documents parameters\n\n Collection Name: Enter the collection name to store the data in.\n\n<!-- vale from-write-good.Weasel = NO -->\n Get Many parameters\n<!-- vale from-write-good.Weasel = YES -->\n\n Collection Name: Enter the collection name to retrieve the data from.\n Prompt: Enter the search query.\n Limit: Enter how many results to retrieve from the vector store. For example, set this to 10 to get the ten best results.\n\n Retrieve Documents (As Vector Store for Chain/Tool) parameters\n\n Collection Name: Enter the collection name to retrieve the data from.\n\n Retrieve Documents (As Tool for AI Agent) parameters\n\n Name: The name of the vector store.\n Description: Explain to the LLM what this tool does. A good, specific description allows LLMs to produce expected results more often.\n Collection Name: Enter the collection name to retrieve the data from.\n Limit: Enter how many results to retrieve from the vector store. For example, set this to 10 to get the ten best results.\n\n Node options\n\n Embedding Dimensions\n\nMust be the same when embedding the data and when querying it.\n\nThis sets the size of the array of floats used to represent the semantic meaning of a text document.\n\n Is Auto Embedded\n\nAvailable in the Insert Documents Operation Mode, enabled by default.\n\nDisable this to configure your embeddings in Zep instead of in n8n.\n\n Metadata Filter\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/langchain-root-nodes/vector-store-metadata-filter.md\"\n\n Templates and examples\n\n<!-- see https://www.notion.so/n8n/Pull-in-templates-for-the-integrations-pages-37c716837b804d30a33b47475f6e3780 -->\n[[ templatesWidget(page.title, 'zep-vector-store') ]]\n\n Related resources\n\nRefer to LangChain's Zep documentation for more information about the service.\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/langchain-overview-link.md\"",
  "category": "cluster-nodes",
  "nodeType": "n8n-nodes-langchain.vectorstorezep.md",
  "keywords": [
    "vector",
    "store",
    "node",
    "this",
    "documents",
    "from",
    "tool",
    "name",
    "retrieve",
    "results"
  ],
  "fetchedAt": "2025-10-07T16:15:27.467Z",
  "hash": "88b0d7cde128cb3ad596f47a38744d85"
}