{
  "title": "HTML",
  "url": "https://docs.n8n.io/integrations/builtin/core-nodes/n8n-nodes-base.html",
  "content": "---\ntitle: HTML\ndescription: Documentation for the HTML node in n8n, a workflow automation platform. Includes guidance on usage, and links to examples.\ncontentType: [integration, reference]\npriority: high\n---\n\n HTML\n\nThe HTML node provides operations to help you work with HTML in n8n.\n\n/// note | HTML Extract node\nThe HTML node replaces the HTML Extract node from version 0.213.0 on. If you're using an older version of n8n, you can still view the HTML Extract node documentation.\n///\n/// warning | Cross-site scripting\nWhen using the HTML node to generate an HTML template you can introduce XSS (cross-site scripting). This is a security risk. Be careful with un-trusted inputs.\n///\n\n Operations\n\n Generate HTML template: Use this operation to create an HTML template. This allows you to take data from your workflow and output it as HTML.\n Extract HTML content: Extract contents from an HTML-formatted source. The source can be in JSON or a binary file (.html).\n Convert to HTML Table: Convert content to an HTML table.\n\nThe node parameters and options depend on the operation you select. Refer to the sections below for more details on configuring each operation.\n\n Generate HTML template\n\nCreate an HTML template. This allows you to take data from your workflow and output it as HTML. \n\nYou can include:\n\n Standard HTML\n CSS in <style> tags.\n JavaScript in <script> tags. n8n doesn't execute the JavaScript.\n Expressions, wrapped in {{}}.\n\nYou can use Expressions in the template, including n8n's Built-in methods and variables. \n\n Extract HTML Content\n\nExtract contents from an HTML-formatted source. The source can be in JSON or a binary file (.html).\n\nUse these parameters:\n\n Source Data\n\nSelect the source type for your HTML content. Choose between:\n\n JSON: If you select this source data, enter the JSON Property: the name of the input containing the HTML you want to extract. The property can contain a string or an array of strings.\n Binary: If you select this source data, enter the Input Binary Field: the name of the input containing the HTML you want to extract. The property can contain a string or an array of strings.\n\n Extraction Values\n\n- Key: Enter the key to save the extracted value under.\n- CSS Selector: Enter the CSS selector to search for.\n- Return Value: Select the type of data to return. Choose from:\n\t- Attribute: Return an attribute value like class from an element.\n\t\t- If you select this option, enter the name of the Attribute to return the value of.\n\t- HTML: Return the HTML that the element contains.\n\t- Text: Return the text content of the element.\n\t\t- If you choose this option, you can also enter a comma-separated list of selectors to skip in the Skip Selectors.\n\t- Value: Return the value of an input, select, or text area.\n- Return Array: Choose whether to return multiple extraction values as an array (turned on) or as a single string (turned off).\n\n Extract HTML Content options\n\nYou can also configure this operation with these options:\n\n Trim Values: Controls whether to remove all spaces and newlines from the beginning and end of the values (turned on) or leaves them (turned off).\n Clean Up Text: Controls whether to remove leading whitespaces, trailing whitespaces, and line breaks (newlines) and condense multiple consecutive whitespaces into a single space (turned on) or to leave them as-is (turned off).\n\n Convert to HTML Table\n\nThis operation expects data from another node. It has no parameters. It includes these options:\n\n Capitalize Headers: Controls whether to capitalize the table's headers (turned on) or not (turned off).\n Custom Styling: Controls whether to use custom styling (turned on) or not (turned off).\n Caption: Enter a caption to add to the table.\n Table Attributes: Enter any attributes to apply to the <table>, such as style attributes.\n Header Attributes: Enter any attributes to apply to the table's headers <th>.\n Row Attributes: Enter any attributes to apply to the table's rows <tr>.\n Cell Attributes: Enter any attributes to apply to the table's cells <td>.\n\n Templates and examples\n\n<!-- see https://www.notion.so/n8n/Pull-in-templates-for-the-integrations-pages-37c716837b804d30a33b47475f6e3780 -->\n[[ templatesWidget(page.title, 'html') ]]",
  "category": "core-nodes",
  "nodeType": "n8n-nodes-base.html.md",
  "keywords": [
    "html",
    "enter",
    "extract",
    "this",
    "table",
    "turned",
    "node",
    "from",
    "return",
    "attributes"
  ],
  "fetchedAt": "2025-10-07T16:14:07.176Z",
  "hash": "88cfc6543affc9d6301997efa42d7dff"
}