{
  "title": "Schedule Trigger node",
  "url": "https://docs.n8n.io/integrations/builtin/core-nodes/n8n-nodes-base.scheduletrigger/index",
  "content": "---\ntitle: Schedule Trigger node documentation\ndescription: Learn how to use the Schedule Trigger node in n8n. Follow technical documentation to integrate Schedule Trigger node into your workflows.\ncontentType: [integration, reference]\npriority: critical\n---\n\n Schedule Trigger node\n\nUse the Schedule Trigger node to run workflows at fixed intervals and times. This works in a similar way to the Cron software utility in Unix-like systems.\n\n/// note | You must activate the workflow\nIf a workflow uses the Schedule node as a trigger, make sure that you save and activate the workflow. \n///\n\n--8<-- \"snippets/integrations/builtin/core-nodes/schedule/timezone-settings.md\"\n\n Node parameters\n\nAdd Trigger Rules to determine when the trigger should run.\n\nUse the Trigger Interval to select the time interval unit of measure to schedule the trigger for. All other parameters depend on the interval you select. Choose from:\n\n- Seconds trigger interval\n- Minutes trigger interval\n- Hours trigger interval\n- Days trigger interval\n- Weeks trigger interval\n- Months trigger interval\n- Custom (Cron) interval\n\nYou can add multiple Trigger Rules to run the node on different schedules.\n\nRefer to the sections below for more detail on configuring each Trigger Interval. Refer to Templates and examples for further examples.\n\n Seconds trigger interval\n\n Seconds Between Triggers: Enter the number of seconds between each workflow trigger. For example, if you enter 30 here, the trigger will run every 30 seconds.\n\n Minutes trigger interval\n\n Minutes Between Triggers: Enter the number of minutes between each workflow trigger. For example, if you enter 5 here, the trigger will run every 5 minutes.\n\n Hours trigger interval\n\n Hours Between Triggers: Enter the number of hours between each workflow trigger.\n Trigger at Minute: Enter the minute past the hour to trigger the node when it runs, from 0 to 59.\n\nFor example, if you enter 6 Hours Between Triggers and 30 Trigger at Minute, the node will run every six hours at 30 minutes past the hour.\n\n Days trigger interval\n\n Days Between Triggers: Enter the number of days between each workflow trigger.\n Trigger at Hour: Select the hour of the day to trigger the node.\n Trigger at Minute: Enter the minute past the hour to trigger the node when it runs, from 0 to 59.\n\n<!-- vale from-microsoft.AMPM = NO -->\nFor example, if you enter 2 Days Between Triggers, 9am for Trigger at Hour, and 15 Trigger at Minute, the node will run every two days at 9:15am.\n<!-- vale from-microsoft.AMPM = YES -->\n\n Weeks trigger interval\n\n Weeks Between Triggers: Enter the number of weeks between each workflow trigger.\n Trigger on Weekdays: Select the day(s) of the week you want to trigger the node.\n Trigger at Hour: Select the hour of the day to trigger the node.\n Trigger at Minute: Enter the minute past the hour to trigger the node when it runs, from 0 to 59.\n\nFor example, if you enter 2 Weeks Between Triggers, Monday for Trigger on Weekdays, 3pm for Trigger at Hour, and 30 Trigger at Minute, the node will run every two weeks on Monday at 3:30 PM.\n\n Months trigger interval\n\n Months Between Triggers: Enter the number of months between each workflow trigger.\n Trigger at Day of Month: Enter the day of the month the day should trigger at, from 1 to 31. If a month doesn't have this day, the node won't trigger. For example, if you enter 30 here, the node won't trigger in February.\n Trigger at Hour: Select the hour of the day to trigger the node.\n Trigger at Minute: Enter the minute past the hour to trigger the node when it runs, from 0 to 59.\n\nFor example, if you enter 3 Months Between Triggers, 28 Trigger at Day of Month, 9am for Trigger at Hour, and 0 Trigger at Minute, the node will run each quarter on the 28th day of the month at 9:00 AM.\n\n Custom (Cron) interval\n\nEnter a custom cron Expression to set the schedule for the trigger.\n\nTo generate a Cron expression, you can use crontab guru. Paste the Cron expression that you generated using crontab guru in the Expression field in n8n.\n\n Examples\n\n<!-- vale from-write-good.Weasel = NO -->\n|Type|Cron Expression|Description|\n|---|---|---|\n|Every X Seconds|/10     |Every 10 seconds.|\n|Every X Minutes|/5    |Every 5 minutes.|\n|Hourly|0    |Every hour on the hour.|\n|Daily|0 6   |At 6:00 AM every day.|\n|Weekly|0 12   1|At noon every Monday.|\n|Monthly|0 0 1  |At midnight on the 1st of every month.|\n|Every X Days|0 0 /3  |At midnight every 3rd day.|\n|Only Weekdays|0 9   1-5|At 9:00 AM Monday through Friday.|\n|Custom Hourly Range|0 9-17   |Every hour from 9:00 AM to 5:00 PM every day.|\n|Quarterly|0 0 1 1,4,7,10 |At midnight on the 1st of January, April, July, and October.|\n<!-- vale from-write-good.Weasel = YES -->\n\n/// warning | Using variables in the Cron expression\nWhile variables can be used in the scheduled trigger, their values only get evaluated when the workflow is activated. If you alter a variable's value in the settings after a workflow is activated, the changes won't alter the cron schedule. To re-evaluate the variable, set the workflow to Inactive and then back to Active again\n/// \n\n Why there are six asterisks in the Cron expression\n\nThe sixth asterisk in the Cron expression represents seconds. Setting this is optional. The node will execute even if you don't set the value for seconds.\n\n|  ()  |    |    |    |    |    |\n|:--:|:--:|:--:|:--:|:--:|:--:|\n|(second)|minute|hour|day of month|month|day of week(Sun-Sat)|\n\n Templates and examples\n\n<!-- see https://www.notion.so/n8n/Pull-in-templates-for-the-integrations-pages-37c716837b804d30a33b47475f6e3780 -->\n[[ templatesWidget(page.title, 'schedule-trigger') ]]\n\n Common issues\n\nFor common questions or issues and suggested solutions, refer to Common Issues.",
  "category": "core-nodes",
  "nodeType": "schedule",
  "keywords": [
    "schedule",
    "trigger",
    "node",
    "enter",
    "interval",
    "hour",
    "every",
    "between",
    "minute",
    "workflow"
  ],
  "fetchedAt": "2025-10-07T16:14:10.965Z",
  "hash": "8cd565bfc1bc31aa9906660056d6c1d7"
}