{
  "title": "Call n8n Workflow Tool node",
  "url": "https://docs.n8n.io/integrations/builtin/cluster-nodes/sub-nodes/n8n-nodes-langchain.toolworkflow",
  "content": "---\ntitle: Call n8n Workflow Tool node documentation\ndescription: Learn how to use the Call n8n Workflow Tool node in n8n. Follow technical documentation to integrate Call n8n Workflow Tool node into your workflows.\ncontentType: [integration, reference]\npriority: high\n---\n\n Call n8n Workflow Tool node\n\nThe Call n8n Workflow Tool node is a tool that allows an agent to run another n8n workflow and fetch its output data. \n\nOn this page, you'll find the node parameters for the Call n8n Workflow Tool node, and links to more resources.\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/sub-node-expression-resolution.md\"\n\n Node parameters\n\n Description\n\nEnter a custom code a description. This tells the agent when to use this tool. For example:\n\n> Call this tool to get a random color. The input should be a string with comma separated names of colors to exclude.\n\n Source\n\nTell n8n which workflow to call. You can choose either:\n\n Database to select the workflow from a list or enter a workflow ID.\n Define Below and copy in a complete workflow JSON.\n\n Workflow Inputs\n\nWhen using Database as workflow source, once you choose a sub-workflow (and define the Workflow Input Schema in the sub-workflow), you can define the Workflow Inputs.\n\nSelect the Refresh button to pull in the input fields from the sub-workflow.\n\nYou can define the workflow input values using any combination of the following options:\n\n providing fixed values\n using expressions to reference data from the current workflow\n letting the AI model specify the parameter by selecting the button AI button on the right side of the field\n using the $fromAI() function in expressions to control the way the model fills in data and to mix AI generated input with other custom input\n\nTo reference data from the current workflow, drag fields from the input panel to the field with the Expressions mode selected.\n\nTo get started with the $fromAI() function, select the \"Let the model define this parameter\" button on the right side of the field and then use the X on the box to revert to user-defined values. The field will change to an expression field pre-populated with the $fromAI() expression. From here, you can customize the expression to add other static or dynamic content, or tweak the $fromAI() function parameters.\n\n Templates and examples\n\n<!-- see https://www.notion.so/n8n/Pull-in-templates-for-the-integrations-pages-37c716837b804d30a33b47475f6e3780 -->\n[[ templatesWidget(page.title, 'workflow-tool') ]]\n\n Related resources\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/tools-link.md\"\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/langchain-overview-link.md\"",
  "category": "cluster-nodes",
  "nodeType": "n8n-nodes-langchain.toolworkflow.md",
  "keywords": [
    "call",
    "workflow",
    "tool",
    "node",
    "input",
    "from",
    "this",
    "with",
    "define",
    "field"
  ],
  "fetchedAt": "2025-10-07T16:15:38.651Z",
  "hash": "92c943dbb074b55018205ddd665bcecf"
}