{
  "title": "Create a workflow",
  "url": "https://docs.n8n.io/workflows/create",
  "content": "---\ndescription: Create, run, and activate workflows.\ncontentType: howto\n---\n\n Create a workflow\n\nA workflow is a collection of nodes connected together to automate a process. You build workflows on the workflow canvas.\n\n Create a workflow\n\n1. Select the <span class=\"n8n-inline-image\">!universal create resource icon{.off-glb}</span> button in the upper-left corner of the side menu. Select workflow.\n2. If your n8n instance supports projects, you'll also need to choose whether to create the workflow inside your personal space or a specific project you have access to. If you're using the community version, you'll always create workflows inside your personal space.\n3. Get started by adding a trigger node: select Add first step...\n\nOr:\n\n1. Select the  <span class=\"n8n-inline-image\">!universal create resource icon{.off-glb}</span> create button in the upper-right corner from either the Overview page or a specific project. Select workflow.\n2. If you're doing this from the Overview page, you'll create the workflow inside your personal space. If you're doing this from inside a project, you'll create the workflow inside that specific project.\n3. Get started by adding a trigger node: select Add first step...\n\nIf it's your first time building a workflow, you may want to use the quickstart guides to quickly try out n8n features.\n\n Run workflows manually\n\nYou may need to run your workflow manually when building and testing, or if your workflow doesn't have a trigger node. \n\nTo run manually, select Execute Workflow.\n\n Run workflows automatically\n\nAll new workflows are inactive by default.\n\nYou need to activate workflows that start with a trigger node or Webhook node so that they can run automatically. When a workflow is inactive, you must run it manually.\n\nTo activate or deactivate your workflow, open your workflow and toggle Inactive / Active.\n\nOnce a workflow is active, it runs whenever its trigger conditions are met.",
  "category": "workflows",
  "nodeType": null,
  "keywords": [
    "create",
    "workflow",
    "your",
    "workflows",
    "select",
    "inside",
    "trigger",
    "node",
    "span",
    "project"
  ],
  "fetchedAt": "2025-10-07T16:15:40.729Z",
  "hash": "9a1788fd76c9f76b14f4ec7a1e45b94b"
}