{
  "title": "JWT",
  "url": "https://docs.n8n.io/integrations/builtin/core-nodes/n8n-nodes-base.jwt",
  "content": "---\ntitle: JWT\ndescription: Documentation for the JWT node in n8n, a workflow automation platform. Includes guidance on usage, and links to examples.\ncontentType: [integration, reference]\npriority: medium\n---\n\n JWT\n\nWork with JSON web tokens in your n8n workflows.\n\n/// note | Credentials\nYou can find authentication information for this node here.\n///\n\n Operations\n\n Decode\n Sign\n Verify\n\n Node parameters\n\n--8<-- \"snippets/integrations/builtin/app-nodes/ai-tools.md\"\n\n Credential to connect with: Select or create a JWT credential to connect with.\n Token: Enter the token to Verify or Decode.\n If you select the Sign operation, you'll also have this parameter:\n     Use JSON to Build Payload: When turned on, the node uses JSON to build the claims. The selection here influences what appears in the Payload Claims section.\n\n Payload Claims\n\nThe node only displays payload claims if you select the Sign operation. What you see depends on what you select for Use JSON to Build Payload:\n\n If you select Use JSON to Build Payload, this section displays a JSON editor where you can construct the claims.\n If you don't select Use JSON to Build Payload, this section prompts you to Add Claim.\n\nYou can add the following claims.\n\n Audience\n\nThe Audience or aud claim identifies the intended recipients of the JWT.\n\nRefer to \"aud\" (Audience) Claim for more information.\n\n Expires In\n\nThe Expires In or exp claim identifies the time after which the JWT expires and must not be accepted for processing.\n\nRefer to \"exp\" (Expiration Time) Claim for more information.\n\n Issuer\n\nThe Issuer or iss claim identifies the principal that issued the JWT.\n\nRefer to \"iss\" (Issuer) Claim for more information.\n\n JWT ID\n\nThe JWT ID or jti claim provides a unique identifier for the JWT.\n\nRefer to \"jti\" (JWT ID) Claim for more information.\n\n Not Before\n\nThe Not Before or nbf claim identifies the time before which the JWT must not be accepted for processing.\n\nRefer to \"nbf\" (Not Before) Claim for more information.\n\n Subject\n\nThe Subject or sub claim identifies the principal that's the subject of the JWT.\n\nRefer to \"sub\" (Subject) Claim for more information.\n\n Node options\n\n Decode node options\n\nThe Return Additional Info toggle controls how much information the node returns.\n\nWhen turned on, the node returns the complete decoded token with information about the header and signature. When turned off, the node only returns the payload.\n\n Sign node options\n\nUse the Override Algorithm control to select the algorithm to use for verifying the token. This algorithm will override the algorithm selected in the credentials.\n\n Verify node options\n\nThis operation includes several node options:\n\n Return Additional Info: This toggle controls how much information the node returns. When turned on, the node returns the complete decoded token with information about the header and signature. When turned off, the node only returns the payload.\n Ignore Expiration: This toggle controls whether the node should ignore the token's expiration time claim (exp). Refer to \"exp\" (Expiration Time) Claim for more information.\n Ignore Not Before Claim: This toggle controls whether to ignore the token's not before claim (nbf). Refer to \"nbf\" (Not Before) Claim for more information.\n Clock Tolerance: Enter the number of seconds to tolerate when checking the nbf and exp claims. This allows you to deal with small clock differences among different servers. Refer to \"exp\" (Expiration Time) Claim for more information.\n Override Algorithm: The algorithm to use for verifying the token. This algorithm will override the algorithm selected in the credentials.\n\n Templates and examples\n\n<!-- see https://www.notion.so/n8n/Pull-in-templates-for-the-integrations-pages-37c716837b804d30a33b47475f6e3780 -->\n[[ templatesWidget(page.title, 'jwt') ]]",
  "category": "core-nodes",
  "nodeType": "n8n-nodes-base.jwt.md",
  "keywords": [
    "claim",
    "node",
    "information",
    "this",
    "payload",
    "refer",
    "more",
    "token",
    "algorithm",
    "json"
  ],
  "fetchedAt": "2025-10-07T16:14:07.992Z",
  "hash": "9b710dd1a2260f589fe46e742a8c1495"
}