{
  "title": "Filter",
  "url": "https://docs.n8n.io/integrations/builtin/core-nodes/n8n-nodes-base.filter",
  "content": "---\ntitle: Filter\ndescription: Documentation for the Filter node in n8n, a workflow automation platform. Includes guidance on usage, and links to examples.\ncontentType: [integration, reference]\npriority: critical\n---\n\n Filter\n\nFilter items based on a condition. If the item meets the condition, the Filter node passes it on to the next node in the Filter node output. If the item doesn't meet the condition, the Filter node omits the item from its output.\n\n Node parameters\n\nCreate filter comparison Conditions to perform your filter.\n\n- Use the data type dropdown to select the data type and comparison operation type for your condition. For example, to filter for dates after a particular date, select Date & Time > is after.\n- The fields and values to enter into the condition change based on the data type and comparison you select. Refer to Available data type comparisons for a full list of all comparisons by data type.\n\nSelect Add condition to create more conditions.\n\n Combining conditions\n\nYou can choose to keep items:\n\n When they meet all conditions: Create two or more conditions and select AND in the dropdown between them.\n When they meet any of the conditions: Create two or more conditions and select OR in the dropdown between them.\n\nYou can't create a mix of AND and OR rules.\n\n Node options\n\n- Ignore Case: Whether to ignore letter case (turned on) or be case sensitive (turned off).\n- Less Strict Type Validation: Whether you want n8n to attempt to convert value types based on the operator you choose (turned on) or not (turned off). Turn this on when facing a \"wrong type:\" error in your node.\n\n Templates and examples\n\n<!-- see https://www.notion.so/n8n/Pull-in-templates-for-the-integrations-pages-37c716837b804d30a33b47475f6e3780 -->\n[[ templatesWidget(page.title, 'filter') ]]\n\n--8<-- \"snippets/integrations/builtin/core-nodes/data-types.md\"",
  "category": "core-nodes",
  "nodeType": "n8n-nodes-base.filter.md",
  "keywords": [
    "filter",
    "node",
    "type",
    "conditions",
    "condition",
    "data",
    "select",
    "create",
    "turned",
    "based"
  ],
  "fetchedAt": "2025-10-07T16:14:06.278Z",
  "hash": "9cfe3168ff7824478eebb4dc990d1ff4"
}