{
  "title": "Google Drive File and Folder operations",
  "url": "https://docs.n8n.io/integrations/builtin/app-nodes/n8n-nodes-base.googledrive/file-folder-operations",
  "content": "---\ntitle: Google Drive File and Folder operations\ndescription: Documentation for the File and Folder operations in Google Drive node in n8n, a workflow automation platform. Includes details of operations and configuration, and links to examples and credentials information.\ncontentType: [integration, reference]\npriority: high\n---\n\n Google Drive File and Folder operations\n\nUse this operation to search for files and folders in Google Drive. Refer to Google Drive for more information on the Google Drive node itself.\n\n--8<-- \"snippets/integrations/builtin/app-nodes/ai-tools.md\"\n\n Search files and folders\n\nUse this operation to search for files and folders in a drive.\n\nEnter these parameters:\n\n- Credential to connect with: Create or select an existing Google Drive credentials.\n- Resource: Select File/Folder.\n- Operation: Select Search.\n- Search Method: Choose how you want to search:\n\t- Search File/Folder Name: Fill out the Search Query with the name of the file or folder you want to search for. Returns files and folders that are partial matches for the query as well.\n\t- Advanced Search: Fill out the Query String to search for files and folders using Google query string syntax.\n- Return All: Choose whether to return all results or only up to a given limit.\n- Limit: The maximum number of items to return when Return All is disabled.\n- Filter: Choose whether to limit the scope of your search:\n\t- Drive: The drive you want to search in. By default, uses your personal \"My Drive\". Select From list to choose the drive from the dropdown list, By URL to enter the URL of the drive, or By ID to enter the driveId. \n\t\t- You can find the driveId by visiting the shared drive in your browser and copying the last URL component: https://drive.google.com/drive/u/1/folders/driveId.\n\t- Folder: The folder to search in. Select From list to choose the folder from the dropdown list, By URL to enter the URL of the folder, or By ID to enter the folderId. \n\t\t- You can find the folderId by visiting the shared folder in your browser and copying the last URL component: https://drive.google.com/drive/u/1/folders/folderId.\n\t- What to Search: Whether to search for Files and Folders, Files, or Folders.\n\t- Include Trashed Items: Whether to also return items in the Drive's trash.\n\n Options\n\n- Fields: Select the fields to return. Can be one or more of the following: [All], explicitlyTrashed, exportLinks, hasThumbnail, iconLink, ID, Kind, mimeType, Name, Permissions, Shared, Spaces, Starred, thumbnailLink, Trashed, Version, or webViewLink.\n\nRefer to the Method: files.list | Google Drive API documentation for more information.",
  "category": "app-nodes",
  "nodeType": null,
  "keywords": [
    "google",
    "drive",
    "file",
    "folder",
    "operations",
    "search",
    "folders",
    "files",
    "select",
    "return",
    "enter"
  ],
  "fetchedAt": "2025-10-07T16:14:31.890Z",
  "hash": "a35697dfbd815c41f0974262935e8ea2"
}