{
  "title": "Gmail node Message Operations",
  "url": "https://docs.n8n.io/integrations/builtin/app-nodes/n8n-nodes-base.gmail/message-operations",
  "content": "---\ntitle: Gmail node Message Operations documentation\ndescription: Learn how to use the Message Operations of the Gmail node in n8n. Follow technical documentation to integrate Message Operations into your workflows.\ncontentType: [integration, reference]\npriority: high\n---\n\n Gmail node Message Operations\n\nUse the Message operations to send, reply to, delete, mark read or unread, add a label to, remove a label from, or get a message or get a list of messages in Gmail. Refer to the Gmail node for more information on the Gmail node itself.\n\n Add Label to a message\n\nUse this operation to add one or more labels to a message.\n\nEnter these parameters:\n\n Select the Credential to connect with or create a new one.\n Resource: Select Message.\n Operation: Select Add Label.\n Message ID: Enter the ID of the message you want to add the label to.\n Label Names or IDs: Select the Label names you want to add or enter an expression to specify IDs. The dropdown populates based on the Credential you selected.\n\n<!-- vale off -->\nRefer to the Gmail API Method: users.messages.modify documentation for more information.\n<!-- vale on -->\n\n Delete a message\n\nUse this operation to immediately and permanently delete a message.\n\n/// note | Permanent deletion\nThis operation can't be undone. For recoverable deletions, use the Thread Trash operation instead.\n///\n\nEnter these parameters:\n\n Select the Credential to connect with or create a new one.\n Resource: Select Message.\n Operation: Select Delete.\n Message ID: Enter the ID of the message you want to delete.\n\nRefer to the Gmail API Method: users.messages.delete documentation for more information.\n\n Get a message\n\nUse this operation to get a single message.\n\nEnter these parameters:\n\n Select the Credential to connect with or create a new one.\n Resource: Select Message.\n Operation: Select Get.\n Message ID: Enter the ID of the message you wish to retrieve.\n Simplify: Choose whether to return a simplified version of the response (turned on) or the raw data (turned off). Default is on.\n     This is the same as setting the format for the API call to metadata, which returns email message IDs, labels, and email headers, including: From, To, CC, BCC, and Subject.\n\nRefer to the Gmail API Method: users.messages.get documentation for more information.\n\n<!-- vale off -->\n Get Many messages\n<!-- vale on -->\n\nUse this operation to get two or more messages.\n\nEnter these parameters:\n\n Select the Credential to connect with or create a new one.\n Resource: Select Message.\n Operation: Select Get Many.\n Return All: Choose whether the node returns all messages (turned on) or only up to a set limit (turned off).\n Limit: Enter the maximum number of messages to return. Only used if you've turned off Return All.\n Simplify: Choose whether to return a simplified version of the response (turned on) or the raw data (turned off). Default is on.\n     This is the same as setting the format for the API call to metadata, which returns email message IDs, labels, and email headers, including: From, To, CC, BCC, and Subject.\n\n<!-- vale off -->\n Get Many messages filters\n<!-- vale on -->\n\nUse these filters to further refine the node's behavior:\n\n Include Spam and Trash: Select whether the node should get messages in the Spam and Trash folders (turned on) or not (turned off).\n Label Names or IDs: Only return messages with the selected labels added to them. Select the Label names you want to apply or enter an expression to specify IDs. The dropdown populates based on the Credential you selected.\n Search: Enter Gmail search refine filters, like from:, to filter the messages returned. Refer to Refine searches in Gmail for more information.\n Read Status: Choose whether to receive Unread and read emails, Unread emails only (default), or Read emails only.\n Received After: Return only those emails received after the specified date and time. Use the date picker to select the day and time or enter an expression to set a date as a string in ISO format or a timestamp in milliseconds. Refer to ISO 8601 for more information on formatting the string.\n Received Before: Return only those emails received before the specified date and time. Use the date picker to select the day and time or enter an expression to set a date as a string in ISO format or a timestamp in milliseconds. Refer to ISO 8601 for more information on formatting the string.\n Sender: Enter an email or a part of a sender name to return messages from only that sender.\n\nRefer to the Gmail API Method: users.messages.list documentation for more information.\n\n Mark as Read\n\nUse this operation to mark a message as read.\n\nEnter these parameters:\n\n Select the Credential to connect with or create a new one.\n Resource: Select Message.\n Operation: Select Mark as Read.\n Message ID: Enter the ID of the message you wish to mark as read.\n\n<!-- vale off -->\nRefer to the Gmail API Method: users.messages.modify documentation for more information.\n<!-- vale on -->\n\n Mark as Unread\n\nUse this operation to mark a message as unread.\n\nEnter these parameters:\n\n Select the Credential to connect with or create a new one.\n Resource: Select Message.\n Operation: Select Mark as Unread.\n Message ID: Enter the ID of the message you wish to mark as unread.\n\n<!-- vale off -->\nRefer to the Gmail API Method: users.messages.modify documentation for more information.\n<!-- vale on -->\n\n Remove Label from a message\n\nUse this operation to remove one or more labels from a message.\n\nEnter these parameters:\n\n Select the Credential to connect with or create a new one.\n Resource: Select Message.\n Operation: Select Remove Label.\n Message ID: Enter the ID of the message you want to remove the label from.\n Label Names or IDs: Select the Label names you want to remove or enter an expression to specify IDs. The dropdown populates based on the Credential you selected.\n\n<!-- vale off -->\nRefer to the Gmail API Method: users.messages.modify documentation for more information.\n<!-- vale on -->\n\n Reply to a message\n\nUse this operation to send a message as a reply to an existing message.\n\nEnter these parameters:\n\n Select the Credential to connect with or create a new one.\n Resource: Select Message.\n Operation: Select Reply.\n Message ID: Enter the ID of the message you want to reply to.\n Select the Email Type. Choose from Text or HTML.\n Message: Enter the email message body.\n\n Reply options\n\nUse these options to further refine the node's behavior:\n\n Append n8n attribution: By default, the node appends the statement This email was sent automatically with n8n to the end of the email. To remove this statement, turn this option off.\n Attachments: Select Add Attachment to add an attachment. Enter the Attachment Field Name (in Input) to identify which field from the input node contains the attachment.\n     For multiple properties, enter a comma-separated list.\n BCC: Enter one or more email addresses for blind copy recipients. Separate multiple email addresses with a comma, for example jay@gatsby.com, jon@smith.com.\n CC: Enter one or more email addresses for carbon copy recipients. Separate multiple email addresses with a comma, for example jay@gatsby.com, jon@smith.com.\n Sender Name: Enter the name you want displayed in your recipients' email as the sender.\n Reply to Sender Only: Choose whether to reply all (turned off) or reply to the sender only (turned on).\n\nRefer to the Gmail API Method: users.messages.send documentation for more information.\n\n Send a message\n\nUse this operation to send a message.\n\nEnter these parameters:\n\n Select the Credential to connect with or create a new one.\n Resource: Select Message.\n Operation: Select Send.\n To: Enter the email address you want the email sent to.\n Subject: Enter the subject line.\n Select the Email Type. Choose from Text or HTML.\n Message: Enter the email message body.\n\n Send options\n\nUse these options to further refine the node's behavior:\n\n Append n8n attribution: By default, the node appends the statement This email was sent automatically",
  "category": "app-nodes",
  "nodeType": "gmail",
  "keywords": [
    "gmail",
    "node",
    "message",
    "operations",
    "enter",
    "select",
    "email",
    "operation",
    "more",
    "messages",
    "this",
    "label"
  ],
  "fetchedAt": "2025-10-07T16:14:28.658Z",
  "hash": "b12bf58c4c2174a29b9e80e2aa612ee7"
}