{
  "title": "Workflow sharing",
  "url": "https://docs.n8n.io/workflows/sharing",
  "content": "---\ndescription: Share workflows between users.\ncontentType: howto\n---\n\n Workflow sharing\n\n/// info | Feature availability\nAvailable on Pro and Enterprise Cloud plans, and Enterprise self-hosted plans.\n///\n\nWorkflow sharing allows you to share workflows between users of the same n8n instance.\n\nUsers can share workflows they created. Instance owners, and users with the admin role, can view and share all workflows in the instance. Refer to Account types for more information about owners and admins.\n\n Share a workflow\n\n1. Open the workflow you want to share.\n2. Select Share.\n3. In Add users, find and select the users you want to share with.\n4. Select Save.\n\n View shared workflows\n\nYou can browse and search workflows on the Workflows list. The workflows in the list depend on the project:\n\n Overview lists all workflows you can access. This includes:\n\t Your own workflows.\n\t Workflows shared with you.\n\t Workflows in projects you're a member of.\n\t If you log in as the instance owner or admin: all workflows in the instance.\n Other projects: all workflows in the project.\n\n Workflow roles and permissions\n\nThere are two workflow roles: creator and editor. The creator is the user who created the workflow. Editors are other users with access to the workflow.\n\nYou can't change the workflow owner, except when deleting the user.\n\n/// note | Credentials\nWorkflow sharing allows editors to use all credentials used in the workflow. This includes credentials that aren't explicitly shared with them using credential sharing.\n///\n Permissions\n\n| Permissions | Creator | Editor | \n| ----------- | ------- | ------ | \n| View workflow (read-only) | :whitecheckmark: | :whitecheckmark: |\n| View executions | :whitecheckmark: | :whitecheckmark: |\n| Update (including tags) | :whitecheckmark: | :whitecheckmark: |\n| Run | :whitecheckmark: | :whitecheckmark: |\n| Share | :whitecheckmark: | :x: |\n| Export | :whitecheckmark: | :whitecheckmark: |\n| Delete | :whitecheckmark: | :x: |\n\n Node editing restrictions with unshared credentials\n\nSharing in n8n works on the principle of least privilege. This means that if a user shares a workflow with you, but they don't share their credentials, you can't edit the nodes within the workflow that use those credentials. You can view and run the workflow, and edit nodes that don't use unshared credentials.\n\nRefer to Credential sharing for guidance on sharing credentials.",
  "category": "workflows",
  "nodeType": null,
  "keywords": [
    "workflow",
    "sharing",
    "workflows",
    "whitecheckmark",
    "share",
    "credentials",
    "users",
    "with",
    "instance",
    "view"
  ],
  "fetchedAt": "2025-10-07T16:15:42.612Z",
  "hash": "c3aa21c6446c9192e47590abe5c54022"
}