{
  "title": "MongoDB Atlas Vector Store node",
  "url": "https://docs.n8n.io/integrations/builtin/cluster-nodes/root-nodes/n8n-nodes-langchain.vectorstoremongodbatlas",
  "content": "---\ntitle: MongoDB Atlas Vector Store node documentation\ndescription: Learn how to use the MongoDB Atlas Vector Store node in n8n. Follow technical documentation to integrate MongoDB Atlas Vector Store node into your workflows.\ncontentType: [integration, reference]\npriority: medium\n---\n\n MongoDB Atlas Vector Store node\n\nMongoDB Atlas Vector Search is a feature of MongoDB Atlas that enables users to store and query vector embeddings. Use this node to interact with Vector Search indexes in your MongoDB Atlas collections. You can insert documents, retrieve documents, and use the vector store in chains or as a tool for agents.\n\nOn this page, you'll find the node parameters for the MongoDB Atlas Vector Store node, and links to more resources.\n\n/// note | Credentials\nYou can find authentication information for this node here.\n///\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/sub-node-expression-resolution.md\"\n\n Prerequisites\n\nBefore using this node, create a Vector Search index in your MongoDB Atlas collection. Follow these steps to create one:\n\n1. Log in to the MongoDB Atlas dashboard.\n\n3. Select your organization and project.\n4. Find \"Search & Vector Search\" section.\n5. Select your cluster and click \"Go to search\".\n7. Click \"Create Search Index\".\n8. Choose \"Vector Search\" mode and use the visual or JSON editors. For example:\n   \n\n9. Adjust the \"dimensions\" value according to your embedding model (For example, 1536 for OpenAI's text-embedding-small-3).\n10. Name your index and create.\n\nMake sure to note the following values which are required when configuring the node:\n\n- Collection name\n- Vector index name \n- Field names for embeddings and metadata\n\n Node usage patterns\n\nYou can use the MongoDB Atlas Vector Store node in the following patterns:\n\n Use as a regular node to insert and retrieve documents\n\nYou can use the MongoDB Atlas Vector Store as a regular node to insert or get documents. This pattern places the MongoDB Atlas Vector Store in the regular connection flow without using an agent.\n\nYou can see an example of this in scenario 1 of this template (the template uses the Supabase Vector Store, but the pattern is the same).\n\n Connect directly to an AI agent as a tool\n\nYou can connect the MongoDB Atlas Vector Store node directly to the tool connector of an AI agent to use the vector store as a resource when answering queries.\n\nHere, the connection would be: AI agent (tools connector) -> MongoDB Atlas Vector Store node.\n\n Use a retriever to fetch documents\n\nYou can use the Vector Store Retriever node with the MongoDB Atlas Vector Store node to fetch documents from the MongoDB Atlas Vector Store node. This is often used with the Question and Answer Chain node to fetch documents from the vector store that match the given chat input.\n\nAn example of the connection flow (the linked example uses Pinecone, but the pattern is the same) would be: Question and Answer Chain (Retriever connector) -> Vector Store Retriever (Vector Store connector) -> MongoDB Atlas Vector Store.\n\n Use the Vector Store Question Answer Tool to answer questions\n\nAnother pattern uses the Vector Store Question Answer Tool to summarize results and answer questions from the MongoDB Atlas Vector Store node. Rather than connecting the MongoDB Atlas Vector Store directly as a tool, this pattern uses a tool specifically designed to summarize data in the vector store.\n\nThe connections flow (the linked example uses the In-Memory Vector Store, but the pattern is the same) in this case would look like this: AI agent (tools connector) -> Vector Store Question Answer Tool (Vector Store connector) -> In-Memory Vector store.\n\n Node parameters\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/vector-store-mode.md\"\n\n Rerank Results\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/vector-store-rerank-results.md\"\n\n<!-- vale off -->\n Get Many parameters\n<!-- vale on -->\n\n- Mongo Collection: Enter the name of the MongoDB collection to use.\n- Vector Index Name: Enter the name of the Vector Search index in your MongoDB Atlas collection.\n- Embedding Field: Enter the field name in your documents that contains the vector embeddings.\n- Metadata Field: Enter the field name in your documents that contains the text metadata.\n\n Insert Documents parameters\n\n- Mongo Collection: Enter the name of the MongoDB collection to use.\n- Vector Index Name: Enter the name of the Vector Search index in your MongoDB Atlas collection.\n- Embedding Field: Enter the field name in your documents that contains the vector embeddings.\n- Metadata Field: Enter the field name in your documents that contains the text metadata.\n\n Retrieve Documents parameters (As Vector Store for Chain/Tool)\n\n- Mongo Collection: Enter the name of the MongoDB collection to use.\n- Vector Index Name: Enter the name of the Vector Search index in your MongoDB Atlas collection.\n- Embedding Field: Enter the field name in your documents that contains the vector embeddings.\n- Metadata Field: Enter the field name in your documents that contains the text metadata.\n\n Retrieve Documents (As Tool for AI Agent) parameters\n\n- Name: The name of the vector store.\n- Description: Explain to the LLM what this tool does. A good, specific description allows LLMs to produce expected results more often.\n- Mongo Collection: Enter the name of the MongoDB collection to use.\n- Vector Index Name: Enter the name of the Vector Search index in your MongoDB Atlas collection.\n- Limit: Enter how many results to retrieve from the vector store. For example, set this to 10 to get the ten best results.\n\n Node options\n\n Options\n\n- Metadata Filter: Filters results based on metadata.\n\n Templates and examples\n\n<!-- see https://www.notion.so/n8n/Pull-in-templates-for-the-integrations-pages-37c716837b804d30a33b47475f6e3780 -->\n[[ templatesWidget(page.title, 'mongodb-atlas-vector-store') ]]\n\n Related resources\n\nRefer to:\n\n- LangChain's MongoDB Atlas Vector Search documentation for more information about the service.\n- MongoDB Atlas Vector Search documentation for more information about MongoDB Atlas Vector Search.\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/langchain-overview-link.md\"\n\n--8<-- \"snippets/self-hosting/starter-kits/self-hosted-ai-starter-kit.md\"",
  "category": "cluster-nodes",
  "nodeType": "n8n-nodes-langchain.vectorstoremongodbatlas.md",
  "keywords": [
    "mongodb",
    "atlas",
    "vector",
    "store",
    "node",
    "name",
    "your",
    "documents",
    "search",
    "enter"
  ],
  "fetchedAt": "2025-10-07T16:15:26.542Z",
  "hash": "c78da3c765ae253d261afc4e06bf6ff8"
}