{
  "title": "Read/Write Files from Disk",
  "url": "https://docs.n8n.io/integrations/builtin/core-nodes/n8n-nodes-base.readwritefile",
  "content": "---\ntitle: Read/Write Files from Disk\ndescription: Documentation for the Read/Write Files from Disk node in n8n, a workflow automation platform. Includes guidance on usage, and links to examples.\ncontentType: [integration, reference]\npriority: critical\n---\n\n Read/Write Files from Disk\n\nUse the Read/Write Files from Disk node to read and write files from/to the machine where n8n is running.\n\n/// note | Self-hosted n8n only\nThis node isn't available on n8n Cloud.\n///\n\n Operations\n\n- Read File(s) From Disk: Use this operation to retrieve one or more files from the computer that runs n8n.\n- Write File to Disk: Use this operation to create a binary file on the computer that runs n8n.\n\nRefer to the sections below for more information on configuring the node for each operation.\n\n Read File(s) From Disk\n\nConfigure this operation with these parameters:\n\n File(s) Selector: Enter the path of the file you want to read.\n\t- To enter multiple files, enter a page path pattern. You can use these characters to define a path pattern:\n\t\t- : Matches any character zero or more times, excluding path separators.\n\t\t- : Matches any character zero or more times, include path separators.\n\t\t- ?: Matches any character except for path separators one time.\n\t\t- []: Matches any characters inside the brackets. For example, [abc] would match the characters a, b, or c, and nothing else.\n\nRefer to Picomatch's Basic globbing documentation for more information on these characters and their expected behavior.\n\n Read File(s) From Disk options\n\nYou can also configure this operation with these Options:\n\n File Extension: Enter the extension for the file in the node output.\n File Name: Enter the name for the file in the node output.\n MIME Type: Enter the file's MIME type in the node output. Refer to Common MIME types for a list of file extensions and their MIME types.\n Put Output File in Field: Enter the name of the field in the output data to contain the file.\n\n Write File to Disk\n\nConfigure this operation with these parameters:\n\n File Path and Name: Enter the destination for the file, the file's name, and the file's extension.\n Input Binary Field: Enter the name of the field in the node input data that will contain the binary file.\n\n Write File to Disk options\n\nYou can also configure this operation with these Options:\n\nThis operation includes a single option, whether to Append data to an existing file instead of creating a new one (turned on) or to create a new file instead of appending to existing (turned off).\n\n Templates and examples\n\n<!-- see https://www.notion.so/n8n/Pull-in-templates-for-the-integrations-pages-37c716837b804d30a33b47475f6e3780 -->\n[[ templatesWidget(page.title, 'readwrite-files-from-disk') ]]\n\n File locations\n\nIf you run n8n in Docker, your command runs in the n8n container and not the Docker host.\n\nThis node looks for files relative to the n8n install path. n8n recommends using absolute file paths to prevent any errors.",
  "category": "core-nodes",
  "nodeType": "n8n-nodes-base.readwritefile.md",
  "keywords": [
    "read/write",
    "files",
    "from",
    "disk",
    "file",
    "read",
    "node",
    "this",
    "enter",
    "write",
    "operation"
  ],
  "fetchedAt": "2025-10-07T16:14:09.391Z",
  "hash": "d4febdb9f76dae3dcb7248e548d8efd9"
}