{
  "title": "Markdown",
  "url": "https://docs.n8n.io/integrations/builtin/core-nodes/n8n-nodes-base.markdown",
  "content": "---\ntitle: Markdown\ndescription: Documentation for the Markdown node in n8n, a workflow automation platform. Includes guidance on usage, and links to examples.\ncontentType: [integration, reference]\npriority: medium\n---\n\n Markdown\n\nThe Markdown node converts between Markdown and HTML formats.\n\n Operations\n\nThis node's operations are Modes:\n\n Markdown to HTML: Use this mode to convert from Markdown to HTML.\n HTML to Markdown: Use this mode to convert from HTML to Markdown.\n\n Node parameters\n\n HTML or Markdown: Enter the data you want to convert. The field name changes based on which Mode you select.\n Destination Key: Enter the field you want to put the output in. Specify nested fields using dots, for example level1.level2.newKey.\n\n Node options\n\nThe node's Options depend on the Mode selected.\n\n/// note | Test out the options\nSome of the options depend on each other or can interact. We recommend testing out options to confirm the effects are what you want.\n///\n\n Markdown to HTML options\n\n| Option | Description | Default |\n| ------ | ----------- | ------- |\n| Add Blank To Links | Whether to open links a new window (enabled) or not (disabled). | Disabled |\n| Automatic Linking To URLs | Whether to automatically link to URLs (enabled) or not (disabled). If enabled, n8n converts any string that it identifies as a URL to a link. | Disabled |\n| Backslash Escapes HTML Tags | Whether to allow backslash escaping of HTML tags (enabled) or not (disabled). When enabled, n8n escapes any < or > prefaced with \\. For example, \\<div\\> renders as &lt;div&gt;.  | Disabled |\n| Complete HTML Document | Whether to output a complete HTML document (enabled) or an HTML fragment (disabled). A complete HTML document includes the <DOCTYPE HTML> declaration, <html> and <body> tags, and the <head> element.  | Disabled |\n| Customized Header ID | Whether to support custom heading IDs (enabled) or not (disabled). When enabled, you can add custom heading IDs using {header ID here} after the heading text. | Disabled |\n| Emoji Support | Whether to support emojis (enabled) or not (disabled). | Disabled. |\n| Encode Emails | Whether to transform ASCII character emails into their equivalent decimal entities (enabled) or not (disabled). | Enabled | \n| Exclude Trailing Punctuation From URLs | Whether to exclude trailing punctuation from automatically linked URLs (enabled) or not (disabled). For use with Automatic Linking To URLs. | Disabled |\n| GitHub Code Blocks | Whether to enable GitHub Flavored Markdown code blocks (enabled) or not (disabled). | Enabled |\n| GitHub Compatible Header IDs | Whether to generate GitHub Flavored Markdown heading IDs (enabled) or not (disabled). GitHub Flavored Markdown generates heading IDs with - in place of spaces and removes non-alphanumeric characters. | Disabled |\n| GitHub Mention Link | Change the link used with GitHub Mentions.  | Disabled |\n| GitHub Mentions | Whether to support tagging GitHub users with @ (enabled) or not (disabled). When enabled, n8n replaces @name with https://github.com/name. | Disabled |\n| GitHub Task Lists | Whether to support GitHub Flavored Markdown task lists (enabled) or not (disabled). | Disabled |\n| Header Level Start | Number. Set the start level for headers. For example, changing this field to 2 causes n8n to treat  as <h2>,  as <h3>, and so on. | 1 |\n| Mandatory Space Before Header | Whether to make a space between  and heading text required (enabled) or not (disabled). When enabled, n8n renders a heading written as Some header text literally (it doesn't turn it into a heading element) | Disabled |\n| Middle Word Asterisks | Whether n8n should treat asterisks in words as Markdown (disabled) or render them as literal asterisks (enabled). | Disabled |\n| Middle Word Underscores | Whether n8n should treat underscores in words as Markdown (disabled) or render them as literal underscores (enabled). | Disabled |\n| No Header ID | Disable automatic generation of header IDs (enabled). | Disabled |\n| Parse Image Dimensions | Support setting maximum image dimensions in Markdown syntax (enabled). | Disabled |\n| Prefix Header ID | Define a prefix to add to header IDs. | None |\n| Raw Header ID | Whether to remove spaces, ', and \" from header IDs, including prefixes, replacing them with - (enabled) or not (disabled). | Disabled |\n| Raw Prefix Header ID | Whether to prevent n8n from modifying header prefixes (enabled) or not (disabled) | Disabled |\n| Simple Line Breaks | Whether to create line breaks without a double space at the end of a line (enabled) or not (disabled). | Disabled |\n| Smart Indentation Fix | Whether to try to smartly fix indentation problems related to ES6 template strings in indented code blocks (enabled) or not (disabled). | Disabled |\n| Spaces Indented Sublists | Whether to remove the requirement to indent sublists four spaces (enabled) or not (disabled). | Disabled |\n| Split Adjacent Blockquotes | Whether to split adjacent blockquote blocks (enabled) or not (disabled). If you don't enable this, n8n treats quotes (indicated by > at the start of the line) on separate lines as a single blockquote, even when separated by an empty line.  | Disabled |\n| Strikethrough | Whether to support strikethrough syntax (enabled) or not (disabled). When enabled, you can add a strikethrough effect using  around the word or phrase. | Disabled |\n| Tables Header ID | Whether to add an ID to table header tags (enabled) or not (disabled). | Disabled |\n| Tables Support | Whether to support tables (enabled) or not (disabled). | Disabled |\n\n HTML to Markdown options\n\n| Option | Description | Default |\n| ------ | ----------- | ------- |\n| Bullet Marker | Specify the character to use for unordered lists. |  |\n| Code Block Fence | Specify the characters to use for code blocks. | `` |\n| Emphasis Delimiter | Specify the character <em>. |  |\n| Global Escape Pattern | Overrides the default character escape settings. You may want to use Text Replacement Pattern instead. | None |\n| Ignored Elements | Ignore given HTML elements, and their children. | None |\n| Keep Images With Data | Whether to keep images with data (enabled) or not (disabled). Support files up to 1MB. | Disabled |\n| Line Start Escape Pattern | Overrides the default character escape settings. You may want to use Text Replacement Pattern instead. | None |\n| Max Consecutive New Lines | Number. Specify the maximum number of consecutive new lines allowed. | 3 |\n| Place URLs At The Bottom | Whether to place URLs at the bottom of the page and format using link reference definitions (enabled) or not (disabled). | Disabled |\n| Strong Delimiter | Specify the characters for <strong>`. |  |\n| Style For Code Block | Specify the styling for code blocks. Options are Fence and Indented. | Fence |\n| Text Replacement Pattern | Define a text replacement pattern using regex. | None |\n| Treat As Blocks | Specify HTML elements to treat as blocks (surround with blank lines) | None |\n\n Templates and examples\n\n<!-- see https://www.notion.so/n8n/Pull-in-templates-for-the-integrations-pages-37c716837b804d30a33b47475f6e3780 -->\n[[ templatesWidget(page.title, 'markdown') ]]\n\n Parsers\n\nn8n uses the following parsers:\n\n To convert from HTML to Markdown: node-html-markdown.\n To convert from Markdown to HTML: Showdown. Some options allow you to extend your Markdown with GitHub Flavored Markdown.",
  "category": "core-nodes",
  "nodeType": "n8n-nodes-base.markdown.md",
  "keywords": [
    "markdown",
    "disabled",
    "enabled",
    "whether",
    "html",
    "header",
    "github",
    "with",
    "support",
    "options"
  ],
  "fetchedAt": "2025-10-07T16:14:08.680Z",
  "hash": "dd8f480d532a0cc79e16b9af8cb36370"
}