{
  "title": "Basic LLM Chain node",
  "url": "https://docs.n8n.io/integrations/builtin/cluster-nodes/root-nodes/n8n-nodes-langchain.chainllm",
  "content": "---\ntitle: Basic LLM Chain node documentation\ndescription: Learn how to use the Basic LLM Chain node in n8n. Follow technical documentation to integrate Basic LLM Chain node into your workflows.\ncontentType: [integration, reference]\npriority: critical\n---\n\n Basic LLM Chain node\n\nUse the Basic LLM Chain node to set the prompt that the model will use along with setting an optional parser for the response.\n\nOn this page, you'll find the node parameters for the Basic LLM Chain node and links to more resources.\n\n/// note | Examples and templates\nFor usage examples and templates to help you get started, refer to n8n's Basic LLM Chain integrations page.\n///\t\n\n Node parameters\n\n Prompt\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/langchain-root-nodes/prompt.md\"\n\n Require Specific Output Format\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/langchain-root-nodes/output-format.md\"\n\n Chat Messages\n\nUse Chat Messages when you're using a chat model to set a message.\n\nn8n ignores these options if you don't connect a chat model. Select the Type Name or ID you want the node to use:\n\n AI\n\nEnter a sample expected response in the Message field. The model will try to respond in the same way in its messages.\n\n System\n\nEnter a system Message to include with the user input to help guide the model in what it should do.\n\nUse this option for things like defining tone, for example: Always respond talking like a pirate.\n\n User\n\nEnter a sample user input. Using this with the AI option can help improve the output of the agent. Using both together provides a sample of an input and expected response (the AI Message) for the model to follow.\n\nSelect one of these input types:\n\n Text: Enter a sample user input as a text Message.\n Image (Binary): Select a binary input from a previous node. Enter the Image Data Field Name to identify which binary field from the previous node contains the image data.\n Image (URL): Use this option to feed an image in from a URL. Enter the Image URL.\n\nFor both the Image types, select the Image Details to control how the model processes the image and generates its textual understanding. Choose from:\n\n Auto: The model uses the auto setting, which looks at the image input size and decide if it should use the Low or High setting.\n Low: The model receives a low-resolution 512px x 512px version of the image and represents the image with a budget of 65 tokens. This allows the API to return faster responses and consume fewer input tokens. Use this option for use cases that don't require high detail.\n High: The model can access the low-resolution image and then creates detailed crops of input images as 512px squares based on the input image size. Each of the detailed crops uses twice the token budget (65 tokens) for a total of 129 tokens. Use this option for use cases that require high detail.\n\n Templates and examples\n\n<!-- see https://www.notion.so/n8n/Pull-in-templates-for-the-integrations-pages-37c716837b804d30a33b47475f6e3780 -->\n[[ templatesWidget(page.title, 'basic-llm-chain') ]]\n\n Related resources\n\nRefer to LangChain's documentation on Basic LLM Chains for more information about the service.\n\n--8<-- \"snippets/integrations/builtin/cluster-nodes/langchain-overview-link.md\"\n\n Common issues\n\nHere are some common errors and issues with the Basic LLM Chain node and steps to resolve or troubleshoot them.\n\n No prompt specified error\n\nThis error displays when the Prompt is empty or invalid.\n\nYou might see this error in one of two scenarios:\n\n1. When you've set the Prompt to Define below and haven't entered anything in the Text field.\n     To resolve, enter a valid prompt in the Text field.\n2. When you've set the Prompt to Connected Chat Trigger Node and the incoming data has no field called chatInput. \n     The node expects the chatInput field. If your previous node doesn't have this field, add an Edit Fields (Set) node to edit an incoming field name to chatInput.",
  "category": "cluster-nodes",
  "nodeType": "n8n-nodes-langchain.chainllm.md",
  "keywords": [
    "basic",
    "chain",
    "node",
    "image",
    "model",
    "this",
    "input",
    "field",
    "prompt",
    "enter"
  ],
  "fetchedAt": "2025-10-07T16:15:24.907Z",
  "hash": "e77853233515c49a63bef0df353f5dbb"
}