{
  "title": "Sticky Notes",
  "url": "https://docs.n8n.io/workflows/components/sticky-notes",
  "content": "---\ndescription: Annotate your workflows using sticky notes.\ncontentType: howto\n---\n\n Sticky Notes\n\nSticky Notes allow you to annotate and comment on your workflows.\n\nn8n recommends using Sticky Notes heavily, especially on template workflows, to help other users understand your workflow.\n\n!Screenshot of a basic workflow with an example sticky note\n\n Create a Sticky Note\n\nSticky Notes are a core node. To add a new Sticky Note:\n\n1. Open the nodes panel.\n2. Search for note.\n3. Click the Sticky Note node. n8n adds a new Sticky Note to the canvas.\n\n Edit a Sticky Note\n\n1. Double click the Sticky Note you want to edit.\n2. Write your note. This guide explains how to format your text with Markdown. n8n uses markdown-it, which implements the CommonMark specification. \n3. Click away from the note, or press Esc, to stop editing.\n\n Change the color\n\nTo change the Sticky Note color:\n\n1. Hover over the Sticky Note\n1. Select Change color <span class=\"n8n-inline-image\">!Change Sticky Note color icon{.off-glb}</span>\n\n Sticky Note positioning\n\nYou can:\n\n Drag a Sticky Note anywhere on the canvas.\n Drag Sticky Notes behind nodes. You can use this to visually group nodes.\n Resize Sticky Notes by hovering over the edge of the note and dragging to resize.\n Change the color: select Options <span class=\"n8n-inline-image\">!Options icon{.off-glb}</span> to open the color selector.\n\n Writing in Markdown\n\nSticky Notes support Markdown formatting. This section describes some common options.\n\nFor a more detailed guide, refer to CommonMark's help. n8n uses markdown-it, which implements the CommonMark specification.\n\n Make images full width\n\nYou can force images to be 100% width of the sticky note by appending full-width to the filename:\n\n Embed a YouTube video\n\nTo display a YouTube video in a note, use the @youtube directive with the video's ID. For this to work, the video's creator must allow embedding.\n\nFor example:\n\nTo embed your own video, copy the above syntax, replacing ZCuL2e4zC4 with your video ID. The YouTube video ID is the string that follows v= in the YouTube URL.",
  "category": "workflows",
  "nodeType": null,
  "keywords": [
    "sticky",
    "notes",
    "note",
    "your",
    "video",
    "color",
    "markdown",
    "change",
    "youtube",
    "with"
  ],
  "fetchedAt": "2025-10-07T16:15:40.592Z",
  "hash": "edf9dafcb7eff081758975ced1a8b689"
}