{
  "title": "XML",
  "url": "https://docs.n8n.io/integrations/builtin/core-nodes/n8n-nodes-base.xml",
  "content": "---\ntitle: XML\ndescription: Documentation for the XML node in n8n, a workflow automation platform. Includes guidance on usage, and links to examples.\ncontentType: [integration, reference]\npriority: medium\n---\n\n XML\n\nUse the XML node to convert data from and to XML.\n\n/// note | Binary files\nIf your XML is within a binary file, use the Extract from File node to convert it to text first.\n///\n\n Node parameters\n\n- Mode: The format the data should be converted from and to.\n\t- JSON to XML: Converts data from JSON to XML.\n    - XML to JSON: Converts data from XML to JSON.\n- Property Name: Enter the name of the property which contains the data to convert.\n\n Node options\n\nThese options are available regardless of the Mode you select:\n\n- Attribute Key: Enter the prefix used to access the attributes. Default is $.\n- Character Key: Enter the prefix used to access the character content. Default is .\n\nAll other options depend on the selected Mode.\n\n JSON to XML options\n\nThese options only appear if you select JSON to XML as the Mode:\n\n- Allow Surrogate Chars: Set whether to allow using characters from the Unicode surrogate blocks (turned on) or not (turned off).\n- Cdata: Set whether to wrap text nodes in <![CDATA[ ... ]]> instead of escaping when it's required (turned on) or not (turned off).\n     Turning this option on doesn't add <![CDATA[ ... ]]> if it's not required.\n- Headless: Set whether to omit the XML header (turned on) or include it (turned off).\n- Root Name: Enter the root element name to use.\n\n XML to JSON options\n\nThese options only appear if you select XML to JSON as the Mode:\n\n- Explicit Array: Set whether to put child nodes in an array (turned on) or create an array only if there's more than one child node (turned off).\n- Explicit Root: Set whether to get the root node in the resulting object (turned on) or not (turned off).\n- Ignore Attributes: Set whether to ignore all XML attributes and only create text nodes (turned on) or not (turned off).\n- Merge Attributes: Set whether to merge attributes and child elements as properties of the parent (turned on) or key attributes off a child attribute object (turned off). This option is ignored if Ignore Attribute is turned on.\n- Normalize: Set whether to trim whitespaces inside the text nodes (turned on) or not to trim them (turned off).\n- Normalize Tags: Set whether to normalize all tag names to lowercase (turned on) or keep tag names as-is (turned off).\n- Trim: Set whether to trim the whitespace at the beginning and end of text nodes (turned on) or to leave the whitespace as-is (turned off).\n\n Templates and examples\n\n<!-- see https://www.notion.so/n8n/Pull-in-templates-for-the-integrations-pages-37c716837b804d30a33b47475f6e3780 -->\n[[ templatesWidget(page.title, 'xml') ]]",
  "category": "core-nodes",
  "nodeType": "n8n-nodes-base.xml.md",
  "keywords": [
    "turned",
    "whether",
    "json",
    "node",
    "options",
    "from",
    "attributes",
    "data",
    "text",
    "mode"
  ],
  "fetchedAt": "2025-10-07T16:14:13.640Z",
  "hash": "f74eec284c0ece0a4ebba7e79e5b870d"
}