{
  "title": "Slack Trigger node",
  "url": "https://docs.n8n.io/integrations/builtin/trigger-nodes/n8n-nodes-base.slacktrigger",
  "content": "---\ntitle: Slack Trigger node documentation\ndescription: Learn how to use the Slack Trigger node in n8n. Follow technical documentation to integrate Slack Trigger node into your workflows.\ncontentType: [integration, reference]\npriority: medium\n---\n\n Slack Trigger node\n\nUse the Slack Trigger node to respond to events in Slack and integrate Slack with other applications. n8n has built-in support for a wide range of Slack events, including new messages, reactions, and new channels.\n\nOn this page, you'll find a list of events the Slack Trigger node can respond to and links to more resources.\n\n///  note  | Credentials\nYou can find authentication information for this node here.\n///\n///  note  | Examples and templates\nFor usage examples and templates to help you get started, refer to n8n's Slack integrations page.\n///\n\n Events\n\n Any Event: The node triggers on any event in Slack.\n Bot / App Mention: The node triggers when your bot or app is mentioned in a channel the app is in.\n File Made Public: The node triggers when a file is made public.\n File Shared: The node triggers when a file is shared in a channel the app is in.\n New Message Posted to Channel: The node triggers when a new message is posted to a channel the app is in.\n New Public Channel Created: The node triggers when a new public channel is created.\n New User: The node triggers when a new user is added to Slack.\n Reaction Added: The node triggers when a reaction is added to a message the app is added to.\n\n Parameters\n\nOnce you've set the events to trigger on, use the remaining parameters to further define the node's behavior:\n\n Watch Whole Workspace: Whether the node should watch for the selected Events in all channels in the workspace (turned on) or not (turned off, default).\n\n    ///warning | Caution\n    This will use one execution for every event in any channel your bot or app is in. Use with caution!\n    ///\n\n Channel to Watch: Select the channel your node should watch for the selected Events. This parameter only appears if you don't turn on Watch Whole Workspace. You can select a channel:\n     From list: The node uses your credential to look up a list of channels in the workspace so you can select the channel you want.\n     By ID: Enter the ID of a channel you want to watch. Slack displays the channel ID at the bottom of the channel details with a one-click copy button.\n     By URL: Enter the URL of the channel you want to watch, formatted as https://app.slack.com/client/<channel-address>.\n Download Files: Whether to download files and use them in the node's output (turned on) or not (turned off, default). Use this parameter with the File Made Public and File Shared events.\n\n Options\n\nYou can further refine the node's behavior when you Add Options:\n\n Resolve IDs: Whether to resolve the IDs to their respective names and return them (turned on) or not (turned off, default).\n Usernames or IDs to ignore: Select usernames or enter a comma-separated string of encoded user IDs to ignore events from. Choose from the list, or specify IDs using an expression.\n\n Related resources\n\nn8n provides an app node for Slack. You can find the node docs here.\n\nView example workflows and related content on n8n's website.\n\nRefer to Slack's documentation for details about their API.\n\n Required scopes\n\nTo use this node, you need to create an application in Slack and enable event subscriptions. Refer to Slack credentials | Slack Trigger configuration for more information.\n\nYou must add the appropriate scopes to your Slack app for this trigger node to work.\n\nThe node requires scopes for the conversations.list and users.list methods at minimum. Check out the Scopes | Slack credentials list for a more complete list of scopes.\n\n Verify the webhook\n\nFrom version 1.106.0, you can set a Slack Signing Secret when configuring your Slack credentials. When set, the Slack trigger node automatically verifies that requests are from Slack and include a trusted signature. n8n recommends setting this to ensure you only process requests sent from Slack.\n\n Common issues\n\nHere are some common errors and issues with the Slack Trigger node and steps to resolve or troubleshoot them.\n\n Workflow only works in testing or production\n\nSlack only allows you to register a single webhook per app. This means that you can't switch from using the testing URL to the production URL (and vice versa) without reconfiguring the registered webhook URL. \n\nYou may have trouble with this if you try to test a workflow that's also active in production. Slack will only send events to one of the two webhook URLs, so the other will never receive event notifications.\n\nTo work around this, you can disable your workflow when testing:\n\n/// warning | Halts production traffic\nThis temporarily disables your production workflow for testing. Your workflow will no longer receive production traffic while it's deactivated.\n///\n\n1. Go to your workflow page.\n2. Toggle the Active switch in the top panel to disable the workflow temporarily.\n3. Edit the Request URL in your the Slack Trigger configuration to use the testing webhook URL instead of the production webhook URL.\n4. Test your workflow using the test webhook URL.\n5. When you finish testing, edit the Request URL in your the Slack Trigger configuration to use the production webhook URL instead of the testing webhook URL.\n6. Toggle the Inactive toggle to enable the workflow again. The production webhook URL should resume working.\n\n Token expired\n\n--8<-- \"snippets/integrations/builtin/credentials/slack/token-rotation.md\"",
  "category": "trigger-nodes",
  "nodeType": "n8n-nodes-base.slacktrigger.md",
  "keywords": [
    "slack",
    "trigger",
    "node",
    "channel",
    "your",
    "this",
    "when",
    "events",
    "webhook",
    "workflow"
  ],
  "fetchedAt": "2025-10-07T16:15:18.268Z",
  "hash": "fc9b9355828aa471a01db4d1e8520b98"
}