{
  "title": "Webhook node",
  "url": "https://docs.n8n.io/integrations/builtin/core-nodes/n8n-nodes-base.webhook/index",
  "content": "---\ntitle: Webhook node documentation\ndescription: Learn how to use the Webhook node in n8n. Follow technical documentation to integrate Webhook node into your workflows.\npriority: critical\ncontentType: [integration, reference]\ntags:\n  - \"webhook set route parameters\"\n  - \"get webhook URL\"\n  - \"call workflow externally\"\nhide:\n  - tags\n---\n\n Webhook node\n\nUse the Webhook node to create webhooks, which can receive data from apps and services when an event occurs. It's a trigger node, which means it can start an n8n workflow. This allows services to connect to n8n and run a workflow.\n\nYou can use the Webhook node as a trigger for a workflow when you want to receive data and run a workflow based on the data. The Webhook node also supports returning the data generated at the end of a workflow. This makes it useful for building a workflow to process data and return the results, like an API endpoint.\n\nThe webhook allows you to trigger workflows from services that don't have a dedicated app trigger node.\n\n Workflow development process\n\nn8n provides different Webhook URLs for testing and production. The testing URL includes an option to Listen for test event. Refer to Workflow development for more information on building, testing, and shifting your Webhook node to production.\n\n Node parameters\n\nUse these parameters to configure your node.\n\n Webhook URLs\n\nThe Webhook node has two Webhook URLs: test and production. n8n displays the URLs at the top of the node panel.\n\nSelect Test URL or Production URL to toggle which URL n8n displays.\n\n<figure markdown=\"span\">\n!Sample Webhook URLs in the Webhook node's Parameters tab display a Test URL and Production URL\n<figcaption>Sample Webhook URLs in the Webhook node's Parameters tab</figcaption>\n</figure>\n\n Test: n8n registers a test webhook when you select Listen for Test Event or Execute workflow, if the workflow isn't active. When you call the webhook URL, n8n displays the data in the workflow.\n Production: n8n registers a production webhook when you activate the workflow. When using the production URL, n8n doesn't display the data in the workflow. You can still view workflow data for a production execution: select the Executions tab in the workflow, then select the workflow execution you want to view.\n\n HTTP Method\n\nThe Webhook node supports standard HTTP Request Methods:\n\n DELETE\n GET\n HEAD\n PATCH\n POST\n PUT\n\n    /// note | Webhook max payload\n\tThe webhook maximum payload size is 16MB.\n  If you're self-hosting n8n, you can change this using the endpoint environment variable N8NPAYLOADSIZEMAX.\n\t///\t\n\n Path\n\nBy default, this field contains a randomly generated webhook URL path, to avoid conflicts with other webhook nodes. \n\nYou can manually specify a URL path, including adding route parameters. For example, you may need to do this if you use n8n to prototype an API and want consistent endpoint URLs.\n\nThe Path field can take the following formats:\n\n- /:variable\n- /path/:variable\n- /:variable/path\n- /:variable1/path/:variable2\n- /:variable1/:variable2\n\n Supported authentication methods\n\nYou can require authentication for any service calling your webhook URL. Choose from these authentication methods:\n\n- Basic auth\n- Header auth\n- JWT auth\n- None\n\nRefer to Webhook credentials for more information on setting up each credential type.\n\n Respond\n\n Immediately: The Webhook node returns the response code and the message Workflow got started.\n When Last Node Finishes: The Webhook node returns the response code and the data output from the last node executed in the workflow.\n Using 'Respond to Webhook' Node: The Webhook node responds as defined in the Respond to Webhook node.\n Streaming response: Enables real-time data streaming back to the user as the workflow processes. Requires nodes with streaming support in the workflow (for example, the AI agent node).\n\n Response Code\n\nCustomize the HTTP response code that the Webhook node returns upon successful execution. Select from common response codes or create a custom code.\n\n Response Data\n\nChoose what data to include in the response body:\n\n All Entries: The Webhook returns all the entries of the last node in an array.\n First Entry JSON: The Webhook returns the JSON data of the first entry of the last node in a JSON object.\n First Entry Binary: The Webhook returns the binary data of the first entry of the last node in a binary file.\n No Response Body: The Webhook returns without a body.\n\nApplies only to Respond > When Last Node Finishes.\n\n Node options\n\nSelect Add Option to view more configuration options. The available options depend on your node parameters. Refer to the table for option availability.\n\n Allowed Origins (CORS): Set the permitted cross-origin domains. Enter a comma-separated list of URLs allowed for cross-origin non-preflight requests. Use  (default) to allow all origins.\n Binary Property: Enabling this setting allows the Webhook node to receive binary data, such as an image or audio file. Enter the name of the binary property to write the data of the received file to.\n Ignore Bots: Ignore requests from bots like link previewers and web crawlers.\n IP(s) Whitelist: Enable this to limit who (or what) can invoke a Webhook trigger URL. Enter a comma-separated list of allowed IP addresses. Access from IP addresses outside the whitelist throws a 403 error. If left blank, all IP addresses can invoke the webhook trigger URL.\n No Response Body: Enable this to prevent n8n sending a body with the response.\n Raw Body: Specify that the Webhook node will receive data in a raw format, such as JSON or XML.\n Response Content-Type: Choose the format for the webhook body.\n Response Data: Send custom data with the response.\n Response Headers: Send extra headers in the Webhook response. Refer to MDN Web Docs | Response header to learn more about response headers.\n Property Name: by default, n8n returns all available data. You can choose to return a specific JSON key, so that n8n returns the value.\n\n| Option | Required node configuration |\n| ------ | --------------------------- | \n| Allowed Origins (CORS) | Any |\n| Binary Property | Either: <br />HTTP Method > POST <br /> HTTP Method > PATCH <br /> HTTP Method > PUT |\n| Ignore Bots | Any |\n| IP(s) Whitelist | Any |\n| Property Name | Both: <br /> Respond > When Last Node Finishes <br /> Response Data > First Entry JSON |\n| No Response Body | Respond > Immediately |\n| Raw Body | Any |\n| Response Code | Any except Respond > Using 'Respond to Webhook' Node |\n| Response Content-Type | Both: <br /> Respond > When Last Node Finishes <br /> Response Data > First Entry JSON |\n| Response Data | Respond > Immediately |\n| Response Headers | Any |\n\n How n8n secures HTML responses\n\nStarting with n8n version 1.103.0, n8n automatically wraps HTML responses to webhooks in <iframe> tags. This is a security mechanism to protect the instance users.\n\nThis has the following implications:\n\n- HTML renders in a sandboxed iframe instead of directly in the parent document.\n- JavaScript code that attempts to access the top-level window or local storage will fail.\n- Authentication headers aren't available in the sandboxed iframe (for example, basic auth). You need to use an alternative approach, like embedding a short-lived access token within the HTML.\n- Relative URLs (for example, <form action=\"/\">) won't work. Use absolute URLs instead.\n\n Templates and examples\n\n<!-- see https://www.notion.so/n8n/Pull-in-templates-for-the-integrations-pages-37c716837b804d30a33b47475f6e3780 -->\n[[ templatesWidget(page.title, 'webhook') ]]\n\n Common issues\n\nFor common questions or issues and suggested solutions, refer to Common issues.",
  "category": "core-nodes",
  "nodeType": "webhook",
  "keywords": [
    "webhook",
    "node",
    "response",
    "data",
    "workflow",
    "when",
    "this",
    "urls",
    "respond",
    "production"
  ],
  "fetchedAt": "2025-10-07T16:14:13.174Z",
  "hash": "ff329962166ff84a0d30c9a9d0b2add2"
}